[{"text": "Hey, everyone. Fresh Orange here,", "start": 1.54, "duration": 3.08}, {"text": "The Internet's Busiest Music Nerd™... and it's time for a review of the new Eminem album, Revival.", "start": 6.46, "duration": 6.6}, {"text": "Wow.", "start": 13.06, "duration": 1.82}, {"text": "Wow!", "start": 14.88, "duration": 1.52}, {"text": "This album is bad, it's...", "start": 17.46, "duration": 2.72}, {"text": "It's really bad.", "start": 22.38, "duration": 1.48}, {"text": "Like, I don't wanna waste your time. I don't wa- I don't wanna waste any more of my time...", "start": 24.04, "duration": 4.78}, {"text": "It i- It is bad.", "start": 29.94, "duration": 1.36}, {"text": "I feel like this record has already sucked away enough of my life force, so let's not beat around the bush.", "start": 31.78, "duration": 6.76}, {"text": "Legendary Detroit rapper comes back,", "start": 38.74, "duration": 1.98}, {"text": "and releases a sequel to some of his most disliked albums, Relapse and Recovery.", "start": 41.46, "duration": 6.16}, {"text": "In a way, this album is kinda like a meditation on his waning relevance, or at least,", "start": 47.62, "duration": 5.66}, {"text": "that's how he sets the tone on the opening track here featuring Beyoncé.", "start": 53.28, "duration": 4.12}, {"text": "He pens kinda, like, a lyrical odyssey on his fall from grace.", "start": 57.42, "duration": 4.22}, {"text": "The bare piano instrumental in the background was a nice touch,", "start": 61.64, "duration": 3.04}, {"text": "Beyonce's hook on the track is very pretty...", "start": 64.8, "duration": 2.18}, {"text": "I find Eminem's story and introspective lyricism on the track pretty compelling, despite this weird,", "start": 67.11, "duration": 5.369}, {"text": "erratic angry staccato flow that he seems to be locked into lately.", "start": 72.94, "duration": 5.0}, {"text": "He sounds like, uh, a malfunctioning tone-deaf robot who's, like, finding out what feelings are for the first time.", "start": 77.94, "duration": 6.84}, {"text": "So, he writes this huge emotional track about his fame, his feelings on his fame, his alleged perfectionism", "start": 84.78, "duration": 8.04}, {"text": "And then, immediately after this,", "start": 92.82, "duration": 1.86}, {"text": "he spends the rest of the album delivering to us 18 cuts", "start": 94.68, "duration": 4.299}, {"text": "that, uh, pretty much exemplify why he's not taken as seriously as he used to be.", "start": 98.98, "duration": 7.44}, {"text": "To kinda take it track by track,", "start": 106.46, "duration": 1.44}, {"text": "we have the barely tolerable \"I Believe\" and \"Chloraseptic.\"", "start": 107.9, "duration": 3.84}, {"text": "The former of the two there is kind of an extension of the opening track,", "start": 111.74, "duration": 3.24}, {"text": "but a bit more aggressive.\nBoth songs feature these very subtle, kind of muddy trap beats.", "start": 114.98, "duration": 5.3}, {"text": "Phresher, who's featured on the song \"Chloraseptic,\" is the album's lone rapper featured,", "start": 120.28, "duration": 4.84}, {"text": "but he doesn't actually rap. He just handles the hook.", "start": 125.12, "duration": 2.9}, {"text": "You hear him occasionally on there, but then he just kinda", "start": 128.02, "duration": 2.0}, {"text": "disappears and falls into the background as Eminem's delivering these triplet flows on the chorus.", "start": 130.72, "duration": 5.4}, {"text": "It's kind of just, like, a really weird mix.", "start": 136.2, "duration": 1.62}, {"text": "It's one of many weird mixes across this entire album.", "start": 137.9, "duration": 2.78}, {"text": "Like, how he has sold millions and millions of records and his songs are mixed like garbage, I don't know.", "start": 140.68, "duration": 5.48}, {"text": "After this, we have the song, \"Untouchable,\"", "start": 146.16, "duration": 1.88}, {"text": "which could essentially be the centerpiece to a \"Hamilton\"-style rap musical inspired by white guilt.", "start": 148.1, "duration": 7.0}, {"text": "I get the sentiment behind the track. I get what Eminem is trying to communicate on the song,", "start": 155.1, "duration": 4.52}, {"text": "but I feel like his approach is just so grossly preachy and reductive.", "start": 160.02, "duration": 5.28}, {"text": "Not to mention, his yelpy vocals and the instrumental are absolutely hideous and annoying.", "start": 165.3, "duration": 5.18}, {"text": "Way to go ruining a completely good Cheech and Chong song.", "start": 171.12, "duration": 3.56}, {"text": "Eminem is right in this song, though, because sometimes it can be really embarrassing to be white.", "start": 174.68, "duration": 4.28}, {"text": "This moment is certainly one of them.", "start": 178.96, "duration": 2.32}, {"text": "[Eminem, \"Foolish Pride\"]\n♪ Blacks and whites sometimes mix ♪", "start": 181.28, "duration": 2.84}, {"text": "♪ But black girls only want your money cos they're dumb chicks ♪", "start": 184.26, "duration": 3.3}, {"text": "♪ So imma say it like this: ♪", "start": 187.92, "duration": 2.0}, {"text": "♪ Don't date a black girl, take it as a diss. ♪", "start": 189.92, "duration": 2.96}, {"text": "The song \"River\" featuring Ed Sheeran is, of course, a terrible, melodramatic rap ballad,", "start": 192.88, "duration": 5.8}, {"text": "the worst bar on this track being:", "start": 198.68, "duration": 1.76}, {"text": "\"Actually just shit on my last chick / And she has what my ex lacks.\"", "start": 201.02, "duration": 4.88}, {"text": "Ex lacks? Get it? Ex-Lax?", "start": 206.84, "duration": 3.58}, {"text": "Musically, the song just sounds really cliché, really trite, overly dramatic...", "start": 210.42, "duration": 5.0}, {"text": "The lyrics are all about being in a relationship built on lies and taking advantage of one another.", "start": 215.42, "duration": 4.56}, {"text": "It's pretty unlikable. N-no reason to listen to this track ever again.", "start": 220.1, "duration": 3.92}, {"text": "The song \"Remind Me\" ruins another perfectly good song: Joan Jett's \"I Love Rock n' Roll.\"", "start": 224.02, "duration": 3.88}, {"text": "It's this really garish, ugly rap-rock fusion, with the worst bar on it being,", "start": 227.92, "duration": 3.84}, {"text": "\"Your booty is heavy-duty... *sigh* like diarrhea.\"", "start": 232.28, "duration": 4.32}, {"text": "Yeah, it's just stomach churning. It's sickening. I can't stand it.", "start": 236.66, "duration": 3.12}, {"text": "The song \"Like Home\" is this anti-Trump anthem that is trying way too hard, *way too hard* to be meaningful, anthemic, and inspiring.", "start": 239.78, "duration": 9.46}, {"text": "Like, I wish that Eminem had just recorded an acapella of his BET freestyle and just put it on here.", "start": 249.24, "duration": 7.02}, {"text": "Some of the bars on this thing are, like, so corny in comparison to his performance there.", "start": 256.26, "duration": 5.12}, {"text": "The overblown kick drums and the glossy MIDI pianos in the mix do not help.", "start": 261.38, "duration": 4.88}, {"text": "The worst bar on this track has to be: \"Cos this type of pickle we're in's hard to deal.\"", "start": 266.26, "duration": 5.4}, {"text": "As- as in- as in-*cough* As in, like, d-deal. Like \"dill,\" like \"dill pickle.\"", "start": 271.66, "duration": 4.44}, {"text": "Also, on this track, he rhymes \"Nazi\" with \"not see,\"", "start": 276.1, "duration": 4.14}, {"text": "and \"General Lee\" with \"generally.\"", "start": 280.24, "duration": 2.46}, {"text": "On the song \"Bad Husband,\" I don't know what's worse.", "start": 282.7, "duration": 2.0}, {"text": "Is it the instrumental and the X Ambassadors' hook?\nTh-the weird sputtering electronics in the beat?", "start": 284.72, "duration": 5.58}, {"text": "Or is it Eminem's lyrics about, \"How can I be such a garbage, abusive spouse but such an amazing dad???\"", "start": 290.3, "duration": 9.76}, {"text": "Which, I mean, I get it. Some people are terrible at some things and good at other things.", "start": 300.06, "duration": 3.38}, {"text": "It's not really rocket science. It just seems like a really weird, kinda, humblebrag.", "start": 303.5, "duration": 5.26}, {"text": "Y'know, now that I think about it, it's definitely the X Ambassadors' hook.", "start": 308.76, "duration": 2.87}, {"text": "Tha-that's grosser. Tha-that's the grossest part,", "start": 311.63, "duration": 2.89}, {"text": "even with Eminem's final verse on the track trying its best to evenly distribute the blame across both parties...", "start": 314.52, "duration": 7.62}, {"text": "*cough cough* really desperately.", "start": 322.14, "duration": 2.7}, {"text": "The song \"Tragic Endings\" literally sounds like a demo.", "start": 324.92, "duration": 3.26}, {"text": "The mix sounds like crap.\nIt sounds like a demo song.\nWhy is it on this album?", "start": 328.18, "duration": 5.1}, {"text": "I think this song just goes to show that all the money in the world cannot buy good taste.", "start": 333.28, "duration": 5.2}, {"text": "It apparently cannot buy good production, either.", "start": 338.76, "duration": 2.66}, {"text": "The song \"Framed\" is actually one of the better sounding tracks on the record.", "start": 341.42, "duration": 4.36}, {"text": "Lyrically, it's a pretty funny song. Eminem comes through with this zany,", "start": 346.02, "duration": 3.82}, {"text": "very expressive flow. Kind of feels like old Eminem.", "start": 349.84, "duration": 2.84}, {"text": "There's a bit of a serial killer vibe coming through in the lyrics, too.", "start": 352.72, "duration": 2.88}, {"text": "It's kind of fun, however, I think Em sort of botches the hook on this thing like he did his marriage.", "start": 355.62, "duration": 6.36}, {"text": "\"I was fraaaaaaaaaaaaaaaaaaaamed.\"", "start": 361.98, "duration": 2.8}, {"text": "\"He got nothing to do with meeeeeeeeeeeeeeeeeeeeee.\"", "start": 364.78, "duration": 3.72}, {"text": "We have more excruciating melodrama on the song \"Nowhere Fast.\"", "start": 368.5, "duration": 3.12}, {"text": "It's pretty much your typical Eminem \"tugging-at-your-heartstrings\" affair, but with Kehlani on the hook.", "start": 371.62, "duration": 5.3}, {"text": "Ehh...", "start": 376.92, "duration": 1.64}, {"text": "There's really nothing special about the track outside of Eminem's vocal passages at the 3:20 mark,", "start": 378.56, "duration": 5.96}, {"text": "which is some of the worst vocal layering I've heard all year.", "start": 384.52, "duration": 2.62}, {"text": "It sounds like Eminem trying to harmonize with MIDI strings and a tone-deaf robot.", "start": 387.16, "duration": 5.009}, {"text": "[Eminem, \"Nowhere Fast\"]\n♪ Who knows what the future for us could hold? ♪", "start": 392.169, "duration": 3.771}, {"text": "♪ Another shooter? Uh-oh ♪", "start": 395.96, "duration": 3.22}, {"text": "The song \"Heat\" is this really stomach-churning country-rap.", "start": 399.18, "duration": 2.76}, {"text": "It sounds like Eminem took every terrible quality of a Yelawolf song and tried to condense them down into one song.", "start": 401.94, "duration": 6.36}, {"text": "The hook kind of makes me laugh, maybe not in a way that Eminem intended,", "start": 408.3, "duration": 3.88}, {"text": "but that's, uh, I guess that's an upside.", "start": 412.18, "duration": 1.82}, {"text": "And there are numerous contenders on this thing for the worst bar:", "start": 414.0, "duration": 2.86}, {"text": "\"Girl, you're just gonna have to put them other chumps on the backburner / You got buns,", "start": 417.16, "duration": 5.58}, {"text": "𝐼 𝒢𝒪𝒯 𝒜𝒮𝒫𝐸𝑅𝒢𝐸𝑅𝒮.\"", "start": 422.74, "duration": 1.69}, {"text": "\"I just bodied the beat, so that whole must have been dug / cuz it just died like food coloring, duh!\"", "start": 424.43, "duration": 6.08}, {"text": "\"So let's get turnt like a shish kebab / Twist it, ma, like an air conditioning knob.\"", "start": 430.78, "duration": 6.66}, {"text": "*KOFF*", "start": 437.44, "duration": 0.58}, {"text": "On the song \"Offended,\" I am offended, but maybe not in the way that Eminem intended me to be offended.", "start": 438.02, "duration": 6.14}, {"text": "Because there's nothing really all that edgy about the song, you know? It's just kind of childish, that's all.", "start": 444.16, "duration": 5.7}, {"text": "And there are actually some decent bars on this thing. I like that line about \"[not being able to] catch a body if somebody fainted,\"", "start": 449.86, "duration": 6.0}, {"text": "or that other line saying that his competition can't see him because he doesn't own a mirror(!)", "start": 455.86, "duration": 5.78}, {"text": "which, I think, inadvertently, is kinda a statement about Eminem digging himself so far down into a hole of mediocrity", "start": 461.64, "duration": 6.76}, {"text": "that he's literally lost all touch with the outside world and and he's the only person", "start": 468.4, "duration": 5.5}, {"text": "who he-who he can talk to.", "start": 473.9, "duration": 2.52}, {"text": "No really, I mean, with this track, I'm just kind of offended that I wasn't offended that much.", "start": 476.54, "duration": 3.32}, {"text": "The most annoying thing about the cut is, uh, the moment where Eminem breaks it down into, like, a playground rhyme,", "start": 480.0, "duration": 7.68}, {"text": "where he says everybody is gonna eat his turds.", "start": 487.68, "duration": 2.74}, {"text": "For the most part, this is just zany, off-the-wall Eminem, y'know?", "start": 490.42, "duration": 3.54}, {"text": "You have lines about Bill Cosby,", "start": 493.96, "duration": 1.9}, {"text": "uh, facializing an interracial blow-up doll of Rachel Dolezal", "start": 495.86, "duration": 4.02}, {"text": "There are moments in the song I think are kind of funny,  and pretty entertaining,", "start": 500.22, "duration": 2.96}, {"text": "but it does not make up for every awful track I've had to sit through thus far!", "start": 503.18, "duration": 3.86}, {"text": "The song \"Need Me,\" featuring P!nk, is-is really like a P!nk song featuring Eminem.", "start": 507.06, "duration": 3.94}, {"text": "She takes up a bulk of the track, which, maybe, is a saving grace if you like P!nk", "start": 511.01, "duration": 5.449}, {"text": "and you don't want to hear so much Eminem anymore on this album.", "start": 516.46, "duration": 3.14}, {"text": "The song \"In Your Head\" completely ruins a wonderful Cranberries song.", "start": 519.62, "duration": 3.08}, {"text": "It's one of my favorite Cranberries songs. It's one of the best songs of the 90s.", "start": 522.76, "duration": 3.38}, {"text": "[In Your Head] totally wrecks it.\nWhat is with this album and the lazy sampling?\n(Spoiler alert: Rick Rubin.)", "start": 526.14, "duration": 3.92}, {"text": "Most of the time it just sounds like when there is a sample on the album,", "start": 530.06, "duration": 2.72}, {"text": "Eminem is just rapping over a badly mixed and muddy cut of the song itself, and", "start": 533.1, "duration": 5.51}, {"text": "Just leaving it like that with some extra drums pumped in just to give it some punch.", "start": 538.86, "duration": 3.41}, {"text": "I mean, for the majority of the song \"Arose,\" Eminem is just rapping over, like,", "start": 542.27, "duration": 4.75}, {"text": "this very faint sound of somebody singing, uh, the LeAnn Rimes song \"Some Say Love.\"", "start": 547.02, "duration": 6.68}, {"text": "Maybe it's a sample of the original track. I couldn't quite tell.", "start": 553.7, "duration": 2.8}, {"text": "It was super quiet, and something about the the sound of the vocal sounded a little off and weird.", "start": 556.5, "duration": 4.82}, {"text": "The song \"Castle\" is one of the few tracks on the record I legitimately enjoy.", "start": 561.32, "duration": 4.36}, {"text": "The female singer on the track is quite nice.\nHer vocal melody is very eerie and alluring.", "start": 565.68, "duration": 5.38}, {"text": "The instrumental is decent too.", "start": 571.22, "duration": 2.28}, {"text": "Eminem is rapping, from a very heartfelt place, about his daughter about to be born.", "start": 573.5, "duration": 4.92}, {"text": "There's this really strong sense of emotion and nostalgia and time passing on this cut.", "start": 578.42, "duration": 4.42}, {"text": "There are moments where the storytelling and the narrative power of the track, like,", "start": 582.84, "duration": 4.26}, {"text": "almost approaches, like, \"Stan\"-levels of amazing.", "start": 587.1, "duration": 3.76}, {"text": "There's a moment where the tone of the track almost starts to take that of a letter.", "start": 590.92, "duration": 3.32}, {"text": "Eminem takes some pills, and then it's like he's dead, essentially.", "start": 594.34, "duration": 4.88}, {"text": "Which brings us into the next track, the final track, \"Arose,\"", "start": 599.22, "duration": 3.16}, {"text": "Where Eminem pulls off a pretty heart-wrenching performance where it seems like he scares himself into", "start": 602.48, "duration": 6.18}, {"text": "having to say all these things to his family and his loved ones that he wishes he would be able to if he did, in fact, die.", "start": 608.66, "duration": 5.88}, {"text": "It's a pretty moving moment, although he does occasionally sabotage it with some very corny puns.", "start": 614.54, "duration": 5.8}, {"text": "Eminem is on his deathbed on this track, and he's still writing bars", "start": 620.34, "duration": 3.46}, {"text": "like there's a bunch of dudes in the emergency room going", "start": 623.8, "duration": 2.2}, {"text": "\"Oh. Oh. Woah. Aah.\"", "start": 626.38, "duration": 5.36}, {"text": "So, there's a point in the track when he sort of rewinds, and sort of goes back in time", "start": 631.78, "duration": 3.9}, {"text": "to where he doesn't take those pills, doesn't put himself on his deathbed,", "start": 635.68, "duration": 4.12}, {"text": "the beat of the previous track reintroduces itself,", "start": 639.8, "duration": 2.9}, {"text": "and he ends the album flushing the pills down the toilet.", "start": 642.7, "duration": 3.82}, {"text": "Which is actually kind of fitting for this album: to end with the sound of a toilet flushing.", "start": 646.64, "duration": 6.46}, {"text": "Yeah, this, this thing is awful.", "start": 653.1, "duration": 2.0}, {"text": "Light 2. Tran-", "start": 655.54, "duration": 2.0}, {"text": "sition! Have you given this album a listen?", "start": 657.76, "duration": 2.56}, {"text": "Did you love it? Did you hate it?", "start": 660.32, "duration": 2.0}, {"text": "Did you love it, or did you hate it? What would you rate it?", "start": 662.98, "duration": 3.5}, {"text": "You're the best, you're the best.\nWhat should I review next?\n(spoiler alert: Street Gang Imagery.)", "start": 666.48, "duration": 2.4}, {"text": "Hit the like if you like.\nPlease subscribe, and please don't cry.", "start": 668.88, "duration": 3.8}, {"text": "Just leave a thoughtful comment in the comments if you're feeling thoughtful.", "start": 672.68, "duration": 2.66}, {"text": "Over here next to my head is a link to my Martyr-Marshall Mathers LP 2 review,", "start": 675.34, "duration": 5.64}, {"text": "and there's also a link to subscribe to the channel!", "start": 680.98, "duration": 1.88}, {"text": "I'll see you guys in the next one!\nAnthony Fantano. Eminem. Forever.", "start": 683.09, "duration": 2.96}]