[{"text": "Hi everyone!", "start": 0.0, "duration": 2.0}, {"text": "AHHHHHH AHHHHHH AHHHHHH here, the Internet's busiest music nerd and it's time for a review of the new", "start": 2.71, "duration": 5.06}, {"text": "self-titled project from Kanye West and Kid Cudi, Kids See Ghosts. Thus far", "start": 8.44, "duration": 5.54}, {"text": "it has been a very busy summer for producer, songwriter,", "start": 13.98, "duration": 3.299}, {"text": "singer,", "start": 17.83, "duration": 1.05}, {"text": "rapper", "start": 18.88, "duration": 1.17}, {"text": "Y-you know who he is, Kanye West", "start": 20.05, "duration": 2.12}, {"text": "Releasing several mini albums within weeks of one another the first of which, while not", "start": 22.539, "duration": 4.729}, {"text": "under his own name did feature his influence and production from front to back. Of course", "start": 27.4, "duration": 5.21}, {"text": "I am talking about Pusha T's Daytona, a 7 track album that just breached 20 minutes in length; all killer", "start": 32.61, "duration": 6.93}, {"text": "no filler. Then following that was Kanye West's new album, \"Ye\"", "start": 39.54, "duration": 3.86}, {"text": "Also 7 tracks, also just over 20 minutes. Equally to the point, though, not as aggressive and finely tuned as Daytona", "start": 43.5, "duration": 7.46}, {"text": "\"ye\" was also noticeably less extravagant and wildly experimental than Kanye's past several albums, too", "start": 50.96, "duration": 6.88}, {"text": "but to me this album still struck me as an incredibly unique and important moment for Ye in just how", "start": 57.84, "duration": 5.309}, {"text": "vulnerable and harrowing the material on this album is. To me this record felt like Kanye going through an ego withdrawal and showing the", "start": 63.37, "duration": 7.369}, {"text": "suicidal and", "start": 71.29, "duration": 1.14}, {"text": "self-destructive lows that fuel his god complex highs, which brings me to the third installment of Kanye related releases this summer", "start": 72.43, "duration": 7.369}, {"text": "Kids See Ghosts", "start": 79.93, "duration": 1.28}, {"text": "I had an inkling that this album wouldn't sound too much unlike the Ghost Town track off of Ye's latest album because it features Kid", "start": 81.21, "duration": 7.349}, {"text": "Cudi, \"Kids See Ghosts\", \"Ghost Town\", and there's also a song on this record titled, \"Freeee (Ghost Town, Pt. 2)\"", "start": 88.56, "duration": 6.419}, {"text": "so there's clearly some kind of linkage going on here", "start": 94.979, "duration": 3.54}, {"text": "So, I kind of got to wondering will Kids See Ghosts be aesthetically similar to that Ghost Town track? Will we see a similar", "start": 98.52, "duration": 5.94}, {"text": "fusion of hip hop and guitar music, maybe even hip hop and rock not too much", "start": 104.59, "duration": 3.889}, {"text": "unlike Kid Cudi's WZRD project, which, I don't know, worries me because I didn't like that album too much", "start": 108.509, "duration": 5.67}, {"text": "Also,", "start": 114.18, "duration": 0.45}, {"text": "I was so skeptical going into this thing because a lot of Kid Cudi solo material has been", "start": 114.63, "duration": 4.169}, {"text": "painfully mediocre since Man on the Moon 2", "start": 119.079, "duration": 2.12}, {"text": "And even though I've enjoyed yays recent releases, he's in such a state of volatility right now", "start": 121.2, "duration": 4.769}, {"text": "Who knows if he can keep this quality up also didn't Kid Cudi and Kanye like have a bit of a rocky", "start": 125.969, "duration": 5.519}, {"text": "Friendship thing lately that could affect this project too. So I did have reasons to be skeptical going into this album, but", "start": 131.86, "duration": 7.759}, {"text": "This record is amazing. It's just as brief as everything else", "start": 141.1, "duration": 3.379}, {"text": "Ye has touched so far this year at 23 minutes and 7 tracks, but it flows", "start": 144.48, "duration": 4.98}, {"text": "fantastically in its short run time feeling like a", "start": 150.19, "duration": 2.389}, {"text": "Full complete album to the point where kids see ghosts actually feels longer than it is", "start": 152.68, "duration": 5.119}, {"text": "It also sounds completely unlike anything. Kanye has dropped so far this year", "start": 157.81, "duration": 4.97}, {"text": "Really dropped ever and sure while as I predicted there are elements of hip hop and rock being fused on this thing", "start": 163.3, "duration": 6.319}, {"text": "There's so much more", "start": 169.62, "duration": 1.32}, {"text": "there are experimental hip hop elements being worked into this thing clearly some Madlib worship here and there and the", "start": 170.94, "duration": 6.0}, {"text": "Grunginess and the brevity of some of these instrumentals and songs. There's even a neo psychedelia edge on this album, too", "start": 177.25, "duration": 6.05}, {"text": "I catch whiffs of some Flaming Lips here and there some Yoshimi soft bulletin", "start": 183.3, "duration": 3.899}, {"text": "Embryonic and even the terror some shots of hard rock and pop and R&B and even grunge get worked into this thing, too", "start": 187.54, "duration": 6.439}, {"text": "occasionally on this record", "start": 194.05, "duration": 1.49}, {"text": "There are some flashes of classic Kanye but there are plenty of moments here too where he is as out there as ever", "start": 195.54, "duration": 5.459}, {"text": "especially with some of the eclectic sample choices one of which is a", "start": 201.19, "duration": 3.829}, {"text": "1930s Christmas song another one being a Kurt Cobain sample typically on this thing Kanye comes off really manic wild out of control", "start": 205.81, "duration": 7.67}, {"text": "Cudi being really forlorn dejected. It's sort of like they're both taking the", "start": 213.55, "duration": 5.33}, {"text": "emotional and and mental problems that they are known for in their music putting out there in their music and sort of", "start": 219.82, "duration": 6.139}, {"text": "Forming them like Voltron together into this short", "start": 226.48, "duration": 2.689}, {"text": "But epic experimental hip-hop opus and in a huge", "start": 229.17, "duration": 3.93}, {"text": "contrast from Kanye's Ye record the production on this thing the verses nearly everything is so", "start": 233.53, "duration": 6.05}, {"text": "meticulously", "start": 240.459, "duration": 1.201}, {"text": "Assembled like the rawness the lo-fi", "start": 241.66, "duration": 2.6}, {"text": "Production the the feeling of lightning in a bottle the feeling that things on the record were just kind of cobbled together", "start": 244.6, "duration": 5.209}, {"text": "That does not carry over on a kid see ghosts at all", "start": 250.09, "duration": 2.99}, {"text": "I definitely get the sense that the songs on this thing were worked on for a very long time", "start": 253.08, "duration": 3.779}, {"text": "The music and the emotions on this thing are on the edge in every way imaginable for me", "start": 257.109, "duration": 5.15}, {"text": "this thing was mind-blowing on impact and", "start": 262.26, "duration": 2.07}, {"text": "Instantaneously catchy - we have the opening track on here feel the love featuring Pusha T", "start": 264.729, "duration": 4.429}, {"text": "Push drops are really expressive and flashy intro verse over these very somber synth chords right after these", "start": 269.159, "duration": 6.54}, {"text": "Distorted vocal leads from Kid Cudi being echoed out into oblivion", "start": 276.31, "duration": 3.739}, {"text": "*I can still feeel the looove*", "start": 280.049, "duration": 1.99}, {"text": "It's a really powerful refrain powerful mantra to kick the record off with not only that but Cuddy singing this loud this forcefully and", "start": 282.039, "duration": 7.76}, {"text": "also this", "start": 290.139, "duration": 1.441}, {"text": "on pitch", "start": 291.58, "duration": 1.44}, {"text": "Right at the start of the record is is a very good sign so far the song sounds pretty cool. Pretty low-key pretty trippy", "start": 293.02, "duration": 6.44}, {"text": "Strange surely. It's a great vibe, but I just did not see coming right around the corner at the end of this verse", "start": 300.069, "duration": 6.29}, {"text": "Kanye busting in and kind of simultaneously locking in with these", "start": 306.969, "duration": 4.43}, {"text": "gunshot snares that are marching away into the end of the song and over these snares she's going", "start": 312.25, "duration": 5.959}, {"text": "*Kra! Kra kra kra! Kra krrrra! Kra!", "start": 318.209, "duration": 3.511}, {"text": "Sounding like Mike Patton while the song builds up this sonic and rhythmic momentum the track suddenly melts into these dreary bass tones and guitar", "start": 321.72, "duration": 7.88}, {"text": "leads that", "start": 329.61, "duration": 1.209}, {"text": "Miraculously Kid Cudi's vocal lead still fits on top of even though this track is really short we've gone through the number of compositional", "start": 330.819, "duration": 7.16}, {"text": "Transitions that you usually hear in a song double its length the song just ends in such a powerful place", "start": 338.38, "duration": 5.659}, {"text": "Thanks to the performance the production really", "start": 344.039, "duration": 2.16}, {"text": "Everything the color the volume the texture it's all on high", "start": 346.509, "duration": 3.5}, {"text": "Fire is a much more low-key moment on the record the shortest song at 2 minutes and 20 seconds", "start": 350.08, "duration": 5.059}, {"text": "It shows Kanye and Cuddy doing their thing over these very gnarly and rough", "start": 355.199, "duration": 5.04}, {"text": "chunky and", "start": 360.819, "duration": 1.35}, {"text": "Twangy guitar samples some eerie woodwind leads to some psychedelic vocal samples and sound effects", "start": 362.169, "duration": 6.41}, {"text": "It doesn't hit as high as sonic Peak as some of the other songs on here, but I do feel like lyrically", "start": 368.58, "duration": 5.369}, {"text": "these are important moments for Kanye and Cudi as it seems like they're kind of", "start": 373.949, "duration": 3.149}, {"text": "Establishing the personality the vibe the brand of of this collaborative project", "start": 377.77, "duration": 4.79}, {"text": "I also think this track works really well as a depressive counterpoint to the intro cut", "start": 382.56, "duration": 4.349}, {"text": "There's also a marching quality to the percussion on this track to the persistent snare drums and tambourines", "start": 386.909, "duration": 6.45}, {"text": "*ba! ba! ba! ba! ba!*", "start": 393.359, "duration": 1.9}, {"text": "Pair that with the guitar sample and Cuddy's haunting humming", "start": 395.259, "duration": 3.23}, {"text": "Hanging in the back and the song essentially sounds to me like a pirate dirge but in the best way possible", "start": 398.86, "duration": 5.809}, {"text": "in the best way possible", "start": 404.83, "duration": 1.88}, {"text": "there's also something about Kanye's verse on this track that just reminds me of", "start": 406.71, "duration": 3.239}, {"text": "2000s era Kanye. It's kind of like he's been resurrected", "start": 410.59, "duration": 2.959}, {"text": "But has a newer darker edge the song fourth dimension though struck me as the most", "start": 413.74, "duration": 4.279}, {"text": "Classic Kanye moment on the entire record this song features the kind of genius level beat production that reminds me of cuts like Jesus walks", "start": 418.3, "duration": 7.1}, {"text": "Kanye drops this hilariously explicit verse. Of course. It's about sex. I love the line in this verse when she tells him", "start": 425.789, "duration": 6.15}, {"text": "He's in the wrong hole and he says he's lost that uh, definitely got to me", "start": 431.94, "duration": 4.109}, {"text": "But also I love how Kanye sort of portrays sex as like this psychedelic experience talking about it as if it's like another dimension", "start": 436.05, "duration": 7.109}, {"text": "That I can definitely fuck with and the the line that he ends his verse with saying that if he goes to jail", "start": 443.38, "duration": 5.929}, {"text": "He won't finish the sin and then the rest of the verses just silence", "start": 449.31, "duration": 3.449}, {"text": "Then Cuddy's verse this dude has not sounded this cold-blooded since the", "start": 454.93, "duration": 5.299}, {"text": "2000s and I just love the camaraderie that is coming through on this album between these guys", "start": 460.539, "duration": 4.91}, {"text": "Already before we've even hit the halfway point", "start": 466.09, "duration": 2.479}, {"text": "It's like Kanye and Kid Cudi are bringing the best out of one another on this record", "start": 468.719, "duration": 3.69}, {"text": "Reminding one another of what each other's strengths are because we know Kanye and Cudi are longtime", "start": 472.87, "duration": 6.289}, {"text": "Admirers of each other's work have inspired one another's work and it's like together in closed quarters on this record", "start": 479.349, "duration": 7.4}, {"text": "They each want to do whatever it is that makes one artist hold the other in such a high regard", "start": 486.849, "duration": 5.78}, {"text": "Because Cudi singing on this thing is more on point than it's been in years. Like he's so on pitch", "start": 492.88, "duration": 6.979}, {"text": "It's scary", "start": 499.86, "duration": 0.809}, {"text": "sometimes", "start": 500.669, "duration": 0.521}, {"text": "I think the shakiest vocal moment for him on this thing is some of the moaning at the start of the track reborn", "start": 501.19, "duration": 5.329}, {"text": "But it's not even really that bad", "start": 506.52, "duration": 1.769}, {"text": "but back to fourth dimension Cudi's bars on this thing are really", "start": 508.289, "duration": 3.27}, {"text": "Slick really trippy and I love the hilarious vocals snippet that sort of ends the song out talking about, you know", "start": 511.69, "duration": 6.229}, {"text": "Just have the music do this and that the other thing and then you know", "start": 517.919, "duration": 2.58}, {"text": "Just two and a half minutes, that's enough for a record. The song free is", "start": 520.5, "duration": 3.299}, {"text": "One of my favorites on here. I mean almost every song on this thing is a favorite of mine", "start": 524.35, "duration": 4.67}, {"text": "It's this crazy hard rock rap fusion. That's just", "start": 529.02, "duration": 3.719}, {"text": "Kanye and Cuddy go absolutely insane on this thing", "start": 534.29, "duration": 3.83}, {"text": "The track is a fantastic extension of some of the themes off the track ghost town throwing out this idea of freedom again", "start": 538.12, "duration": 6.269}, {"text": "And again and again and not just simply", "start": 544.389, "duration": 2.0}, {"text": "social or political freedom really a", "start": 546.709, "duration": 2.09}, {"text": "existential freedom freedom from pain freedom from like mortality the song features these", "start": 549.68, "duration": 5.239}, {"text": "blaring samples have chopped up hard rock guitars", "start": 555.29, "duration": 2.929}, {"text": "It sounds like something out of a Led Zeppelin song", "start": 558.22, "duration": 2.46}, {"text": "A lot of the instrumental though is owed to a very generous sample from a UK", "start": 560.68, "duration": 4.469}, {"text": "Instrumental hip hop producer who goes by the name of mr", "start": 565.279, "duration": 2.419}, {"text": "chop", "start": 567.699, "duration": 0.481}, {"text": "But even knowing that what Cuddy Kanye and ty dolla sign to do on top of this beat is incredible their gargantuan godlike", "start": 568.18, "duration": 7.379}, {"text": "proclamations of I feel", "start": 575.93, "duration": 2.0}, {"text": "FREEEEEEEEE", "start": 577.93, "duration": 1.089}, {"text": "Every single time Kanye and cutting shout that line. I feel like I'm being thrown down into a", "start": 579.019, "duration": 4.369}, {"text": "kaleidoscopic wormhole where all these colors are swirling around my brain ty dolla sign brings these", "start": 583.97, "duration": 5.21}, {"text": "Amazing vocal harmonies like these super dense super thick how many vocals are multi-tracked on top of each other it sounds so", "start": 589.85, "duration": 7.58}, {"text": "AAAAAH", "start": 597.43, "duration": 0.969}, {"text": "Even though ty dolla sign isn't delivering as extrema vocal performance as Kanye or Cuddy", "start": 598.399, "duration": 5.299}, {"text": "He sounds rock and roll as fuck. Again,", "start": 603.699, "duration": 2.22}, {"text": "Kanye sounds absolutely manic on this track. Kid Cudi less", "start": 606.11, "duration": 4.64}, {"text": "So but there's a bit of sass to some of what he delivers on the track", "start": 610.75, "duration": 3.839}, {"text": "Guess what babe? This song is not simply just a fantastic song by itself. It's also redemption for me, too", "start": 614.809, "duration": 6.56}, {"text": "Like it's a fantastic follow-up to ghost town", "start": 621.439, "duration": 2.36}, {"text": "it also sounds like what wizard should have been and the the the godlike vibe of this track the", "start": 623.87, "duration": 7.579}, {"text": "supernatural vibe of this track feels like something yeezus should have achieved reborn is an", "start": 631.759, "duration": 5.24}, {"text": "amazing and for Lauren cooled down after this cut Cudi singing truly makes the track and I love the songs lyrical themes of", "start": 637.279, "duration": 7.13}, {"text": "Moving forward and having no stress getting a clean slate beginning anew the need to hit the reset button once again", "start": 644.629, "duration": 7.429}, {"text": "Kanye drops a fantastic verse on this cut", "start": 652.279, "duration": 2.69}, {"text": "That is one of his most", "start": 654.97, "duration": 0.969}, {"text": "personal yet kind of echoing this very sentiment the haunting background vocals and cue piano and dusty beat may not sound like much just", "start": 655.939, "duration": 7.73}, {"text": "Listing them out", "start": 663.67, "duration": 0.69}, {"text": "But they do a whole lot with very little the refrain Cuddy ends with on this track too - I think adds a very powerful", "start": 664.36, "duration": 6.039}, {"text": "Sentiment to the song questioning which way should he go after either?", "start": 670.74, "duration": 3.679}, {"text": "Fucking up or going through this reborn process where maybe he's bound to make the same mistakes again", "start": 674.85, "duration": 5.869}, {"text": "Then there is the incredibly chilling title track which features the most", "start": 680.72, "duration": 3.72}, {"text": "Meditative instrumental on the entire record more supernatural vibes coming off of this track a really eerie", "start": 684.69, "duration": 5.959}, {"text": "synth lead. A spectral chord progression. Yes. Yngwie aka mos def", "start": 691.019, "duration": 3.95}, {"text": "Also featuring on this thing on the back end in a very wise and in Sage like short verse", "start": 695.49, "duration": 6.95}, {"text": "Kanye's verse is so great on this thing", "start": 702.81, "duration": 1.91}, {"text": "he comes through with so much authority and the finishing Cuddy montage just ends things off with", "start": 704.72, "duration": 5.34}, {"text": "Fireworks the strung out guitar that that basically makes up the bulk of the instrumental here, which is a Kurt Cobain sample", "start": 710.31, "duration": 6.619}, {"text": "It's kind of like Cuddy is taking those grunge vibes that he was trying to execute on speeding bullet to heaven", "start": 716.93, "duration": 4.799}, {"text": "But giving them the the song the platform they finally deserve also", "start": 721.73, "duration": 3.63}, {"text": "I love the way the track transitions from these dirty grimy lowdown verses to these heavenly", "start": 725.36, "duration": 6.119}, {"text": "Vocal harmonies with Cuddy singing out into the ether with a lot of reverb on his voice. Whoa", "start": 731.94, "duration": 4.789}, {"text": "Whoa, then all these incredibly eerie auto-tune vocal harmonies shoot back stay strong", "start": 736.73, "duration": 4.89}, {"text": "Lord shine a light on me, save me please. Damn, the vocal melodies. They put together on this track is just incredible", "start": 741.889, "duration": 6.3}, {"text": "Kanye's verse is fantastic on this thing too displaying this cycle of violence", "start": 748.29, "duration": 3.799}, {"text": "Like really one of his most conscious sets of bars and years this whole idea of asking or begging to be saved by this", "start": 752.089, "duration": 6.63}, {"text": "supernatural power for a record like this to me is a", "start": 758.819, "duration": 2.6}, {"text": "pretty powerful sentiment to end on I also love some of the psychedelics since that go into this track - again enhancing that neo", "start": 761.699, "duration": 6.05}, {"text": "psychedelic edge and just what a", "start": 767.94, "duration": 2.0}, {"text": "fantastic collection of tracks and", "start": 770.22, "duration": 2.54}, {"text": "I don't necessarily see this album as just simply being a standalone thing", "start": 772.889, "duration": 4.28}, {"text": "I very much see this record and \"Ye\" to be connected", "start": 777.17, "duration": 3.69}, {"text": "Somehow. Making it difficult for me personally to look at this and say oh, you know, it's just seven tracks", "start": 781.26, "duration": 5.209}, {"text": "It's just twenty minutes of music. No, I mean in the grander scheme of things, I feel like this album is very much tied to", "start": 786.47, "duration": 5.369}, {"text": "--Ye's recent release but the track listing on this thing is so", "start": 792.509, "duration": 3.41}, {"text": "Freakin watertight. There's not a song on this that I don't love - some agree or I don't think adds to the", "start": 796.47, "duration": 6.56}, {"text": "tracklisting fantastically every song builds on the next to create this", "start": 803.58, "duration": 3.979}, {"text": "overwhelming", "start": 808.08, "duration": 1.29}, {"text": "mind-altering and strangely beautiful vibe", "start": 809.37, "duration": 2.57}, {"text": "I truly feel like Kanye and Cuddy put one another", "start": 811.94, "duration": 3.09}, {"text": "artistically to the test on this thing with an amazing mix of emotion sound and genres all of which are super vivid just", "start": 815.37, "duration": 6.95}, {"text": "crashing into one another in this violently", "start": 822.54, "duration": 3.44}, {"text": "beautiful display", "start": 826.59, "duration": 1.04}, {"text": "It's like the cosmos imploding and reality melting and the The Matrix glitching and I'm also super impressed with how forward-thinking", "start": 827.63, "duration": 7.109}, {"text": "Difficult to pin down and futuristic. This album feels - I am legit feelin a strong 9 - a 10 on this thing", "start": 835.17, "duration": 7.789}, {"text": "What do you what do you think of that?", "start": 844.5, "duration": 2.0}, {"text": "*snoring*", "start": 846.5, "duration": 2.44}, {"text": "Hey, hey, what do you what do you is this is this exciting to you? Is this does this interest you at all?", "start": 848.96, "duration": 6.38}, {"text": "*more snoring*", "start": 855.34, "duration": 6.46}, {"text": "Well, I liked it I liked it a lot.", "start": 861.8, "duration": 2.0}, {"text": "Transition have you given this album a listen, did you love it? Did you hate it? What would you rate it?", "start": 865.47, "duration": 4.669}, {"text": "You're the best. You're the best", "start": 870.14, "duration": 0.96}, {"text": "What should I review next to the like if you like, please subscribe and please don't", "start": 871.1, "duration": 3.359}, {"text": "Cry just leave a comment in the comments", "start": 874.68, "duration": 2.57}, {"text": "If you're feeling full of thoughts", "start": 877.25, "duration": 1.39}, {"text": "Over here next to my head is another video that you can check out hit that up or the link to subscribe to the channel", "start": 878.64, "duration": 4.46}, {"text": "Anthony Fantano, kid see ghosts foreverrrr!", "start": 883.74, "duration": 2.96}]