[{"text": "Hey everyone, Anthony Fantano here,", "start": 0.0, "duration": 1.92}, {"text": "'The Internet's Busiest Music Nerd' and it's time for a review of the new Mount Eerie album,", "start": 1.92, "duration": 5.64}, {"text": "'Now Only'.", "start": 7.56, "duration": 0.73}, {"text": "This is singer/songwriter Phil Elverum's latest musical", "start": 8.29, "duration": 3.5}, {"text": "transmission under the 'Mount Eerie' name, and Phil, if you're unfamiliar with him, in my opinion, is one of indie-folk's and low-fi", "start": 12.16, "duration": 7.91}, {"text": "music's most creative musicians,", "start": 20.07, "duration": 2.0}, {"text": "creative producers, not only when you take into account the fantastic albums", "start": 22.48, "duration": 4.25}, {"text": "he came out with under the 'Mount Eerie' name", "start": 26.73, "duration": 1.83}, {"text": "but also 'The Microphones', 'The Globe Part 2', 'Lost Wisdom', 'No Flashlight',", "start": 28.56, "duration": 5.76}, {"text": "'It Was Hot, We Stayed in Water' and also last year's incredibly devastating", "start": 34.36, "duration": 5.66}, {"text": "'A Crow Looked at Me', in my opinion, one of the best records of last year while also being one of the", "start": 40.57, "duration": 6.079}, {"text": "most emotionally traumatising as the album is a deep dive into the excruciating", "start": 47.05, "duration": 5.509}, {"text": "details of Phil's life around the time his wife passed away of cancer.", "start": 52.989, "duration": 4.13}, {"text": "Singing about her sickness, her passing, therapy, single fatherhood also", "start": 57.67, "duration": 5.93}, {"text": "wrestling with the feelings of grief, shock, denial,", "start": 64.33, "duration": 3.769}, {"text": "etc. This next album now only deals in a lot of the same themes, feelings,", "start": 68.92, "duration": 5.029}, {"text": "experiences, but is decidedly different", "start": 74.5, "duration": 2.509}, {"text": "stylistically the", "start": 77.77, "duration": 1.41}, {"text": "instrumentation on this album isn't quite as", "start": 79.18, "duration": 2.209}, {"text": "stark, isn't quite as low-key. The writing and structuring of these tracks is not quite as direct or pointed either, there are quite a few", "start": 81.97, "duration": 7.069}, {"text": "long and very winding songs on this record with some kind of meandering narratives,", "start": 89.59, "duration": 5.12}, {"text": "it's almost like Phil is writing a", "start": 94.71, "duration": 2.099}, {"text": "letter or a postcard just off of the top of his head to a loved one", "start": 97.119, "duration": 4.459}, {"text": "or, I guess, generally his audience. Of", "start": 101.579, "duration": 3.3}, {"text": "everything that's been happening to him, even down to the minor details since we last heard from him and honestly,", "start": 105.189, "duration": 5.75}, {"text": "it's all got a little bit, just a little bit of a Mark Kozelek, Sun Kil moon vibe to it.", "start": 111.009, "duration": 6.86}, {"text": "It's an interesting influence to hear pop up in Phil's music, as well as other records too, it seems like this long, rambly, uh, very off-the-cuff", "start": 117.869, "duration": 10.011}, {"text": "songwriting style that Mark has popularized this decade has been adopted by quite a few artists that I like.", "start": 128.56, "duration": 6.64}, {"text": "This album is 44 minutes features a handful of tracks that range from five to about 10 minutes.", "start": 135.2, "duration": 6.18}, {"text": "Some of the moments on this record are really emotionally compelling and", "start": 141.52, "duration": 4.3}, {"text": "heart-wrenching.", "start": 146.16, "duration": 0.76}, {"text": "Very straightforward in their storytelling like the track Tintin in Tibet which is a minor", "start": 147.12, "duration": 4.62}, {"text": "reference within the story itself contained in the song where Phil is essentially singing about being younger, having met his wife,", "start": 151.81, "duration": 7.399}, {"text": "living in a moment in their relationship where they were just deeply in love,", "start": 159.819, "duration": 4.19}, {"text": "finding out about one another and then juxtaposing that against moments in their relationship when she was sick and", "start": 164.56, "duration": 6.32}, {"text": "their time together was coming to a close. It's a really hard-hitting moment on the album, it's a strong", "start": 171.91, "duration": 6.079}, {"text": "sentiment to start the record off with and it's", "start": 178.5, "duration": 2.5}, {"text": "painfully clear that Phil is still kind of suffering through the agony of his feelings around this and understandably so.", "start": 181.62, "duration": 5.78}, {"text": "But it seems, at least to me, that when Phil switches over to tracks like 'Distortion' that are a little bit longer", "start": 187.74, "duration": 6.5}, {"text": "in their run-time and a little bit more rambly, a little bit more dishevelled", "start": 194.64, "duration": 3.52}, {"text": "he is no longer playing to his strengths as", "start": 198.22, "duration": 2.929}, {"text": "a songwriter or maybe this is just something that he needs to feel out a little bit more in order to make a", "start": 201.459, "duration": 4.79}, {"text": "more compelling track because while a lot of the same themes of emotional pain and loneliness and even a", "start": 206.5, "duration": 6.979}, {"text": "bit of a narrative moment where Phil is talking about being younger and having a pregnancy scare. Even though", "start": 213.94, "duration": 6.739}, {"text": "this is all very familiar given what he's been singing about lately, it's all kind of inconclusive and doesn't add up to too much.", "start": 220.68, "duration": 7.44}, {"text": "It's an OK listen at the end of the day", "start": 228.12, "duration": 1.92}, {"text": "but I feel roughly the same way about the 'Two Paintings by Nikolai", "start": 230.04, "duration": 3.479}, {"text": "Astrup', track the second longest song on the album later in the tracklist.", "start": 233.65, "duration": 4.309}, {"text": "I love and am enchanted by Phil's music a majority of the time, but do I find him to be", "start": 238.109, "duration": 5.4}, {"text": "so gripping a storyteller, to have so strong a delivery that he can just throw any minor detail out there", "start": 244.209, "duration": 5.839}, {"text": "and it just kind of keeps me on the edge of my seat in a song? Not necessarily, although", "start": 250.049, "duration": 5.01}, {"text": "I understand why at this point in his life", "start": 255.06, "duration": 2.19}, {"text": "he would kind of be obsessing over every minor detail", "start": 257.25, "duration": 2.579}, {"text": "as it does add to some incredibly cutting moments on this album especially on the closer where he is", "start": 259.93, "duration": 6.32}, {"text": "singing about his daughter wanting to hear Mommie's record, a record with her mother on it as she was a musician as well, a", "start": 266.919, "duration": 7.25}, {"text": "recording artist and this leads Phil to a point where they're listening to the album", "start": 274.419, "duration": 4.58}, {"text": "and he is sobbing in the middle of eating breakfast, something that personally I can't even begin to imagine", "start": 279.069, "duration": 6.62}, {"text": "dealing with. The title track on this record is one of the more succinct ones in the track listing it has a", "start": 286.81, "duration": 5.75}, {"text": "purposefully sweet and very melodic chorus that kind of", "start": 292.9, "duration": 3.589}, {"text": "talks about death and dying in a somewhat flippant manner about people getting cancer and dying getting hit by trucks and dying,", "start": 296.71, "duration": 6.649}, {"text": "but I feel like this is all a very admirable attempt by Phil to make a statement on", "start": 303.36, "duration": 4.35}, {"text": "just generally the callousness that a lot of people have toward death", "start": 308.139, "duration": 4.19}, {"text": "or just being so absorbed in their own", "start": 312.33, "duration": 2.369}, {"text": "issues that it's not really something they think about when other people may be going through it. As we see Phil filing through a", "start": 314.83, "duration": 5.029}, {"text": "hospital setting, as we see him filing through a setting where he's at a music festival", "start": 319.93, "duration": 4.369}, {"text": "and he has to play these, what he describes as 'death songs' for 'kids on drugs'.", "start": 324.3, "duration": 3.869}, {"text": "And then there is the maybe most haunting and morbid track on the entire record, 'Earth',", "start": 328.389, "duration": 5.51}, {"text": "which not only has a pretty interesting 'Wolves in the Throne Room' reference", "start": 333.94, "duration": 3.649}, {"text": "but is also a song where Phil is literally dealing with the transformation of his significant other", "start": 337.59, "duration": 5.759}, {"text": "from a living breathing human being to", "start": 343.719, "duration": 2.63}, {"text": "cremated ashes, remains. The instrumental on this track might not seem like much more than just some droney keys and guitars,", "start": 347.59, "duration": 6.619}, {"text": "occasionally a sort of wild, loud, distorted indie rock passage but it serves as a pretty great backdrop for his", "start": 354.849, "duration": 6.65}, {"text": "attempt to kind of process", "start": 362.469, "duration": 1.591}, {"text": "this, because it's really just kind of intense with how directly he stares into this abyss of death in his art, uh,", "start": 364.06, "duration": 7.25}, {"text": "especially as of late to the point where I find his music to be enjoyable and bold and brave and unique but also", "start": 371.71, "duration": 6.529}, {"text": "concerning too, which I guess that that's been my attitude since the last album as well,", "start": 378.819, "duration": 4.85}, {"text": "I mean I love Phil's music, I think he's a great artist but still I hope he's", "start": 383.68, "duration": 3.84}, {"text": "doing better, I hope he's healing, I hope he's okay.", "start": 388.24, "duration": 3.94}, {"text": "To me this album is a bunch of very good 'Crow' afterthoughts, sort of like an epilogue of sorts in a way. I", "start": 392.64, "duration": 5.68}, {"text": "liked it quite a bit, as a fan I like that", "start": 398.34, "duration": 1.86}, {"text": "he took some compositional risks on this record too, but it's maybe not an album", "start": 400.2, "duration": 4.199}, {"text": "I would recommend to a newcomer as it correlates directly with the last record", "start": 404.4, "duration": 4.41}, {"text": "which one probably should listen to first and isn't necessarily one of his most accessible.", "start": 408.81, "duration": 5.16}, {"text": "I'm feeling a decent 7 on this one transition, have you given this album a listen?", "start": 413.97, "duration": 5.55}, {"text": "Did you love it? Did you hate it? What would you rate it? You're the best, you're the best.", "start": 419.52, "duration": 2.819}, {"text": "What should I review next? Hit the like if you like, please subscribe and please don't die, just leave a, uhhh,", "start": 422.34, "duration": 5.49}, {"text": "y'know thoughtful comment in the comments if you're feeling full of thoughts, okay. Make sure to hit the subscription", "start": 428.71, "duration": 5.779}, {"text": "button and the bell", "start": 435.13, "duration": 2.0}, {"text": "because YouTube isn't going to sort of put my videos in your subscription box, probably, and", "start": 437.53, "duration": 5.149}, {"text": "also, there's a video next to my head you should check out too. Anthony Fantano, forever.", "start": 443.14, "duration": 3.799}]