[{"text": "Hello everybody bithony flatano here", "start": 0.219, "duration": 3.08}, {"text": "The Internet's busiest music nerd and it's time for a review of the new J. Cole album", "start": 3.51, "duration": 6.75}, {"text": "KOD, this is the fifth full-length album from the North Carolina rapper and what can really be said at this point that I or", "start": 10.96, "duration": 7.759}, {"text": "Somebody else hasn't said already about J. Cole", "start": 18.97, "duration": 3.17}, {"text": "supposedly woke rapper who does mainstream numbers and yet", "start": 22.14, "duration": 4.17}, {"text": "somehow falls short of his full potential with nearly every release given his track record", "start": 26.769, "duration": 5.78}, {"text": "I'm not really sure if I expected that much different this time around though I know at the end of the day", "start": 32.549, "duration": 6.351}, {"text": "J Cole is- is smart enough to do better", "start": 38.9, "duration": 2.5}, {"text": "He's talented enough to do better so my fingers are always crossed even if his hardcore fans", "start": 41.8, "duration": 5.419}, {"text": "Seem like they're into where he's at right now", "start": 47.62, "duration": 2.75}, {"text": "They don't want him to change and maybe are creating less motivation for him to do so; so this thing is a pretty tight", "start": 50.649, "duration": 5.78}, {"text": "It's a pretty trim album. It's 12 tracks that breeze by relatively quickly and", "start": 56.43, "duration": 4.829}, {"text": "It's it's like 44 minutes or so kicks off with an intro with a lot of spacey instrumentation, a female narrator", "start": 61.809, "duration": 6.68}, {"text": "going on about how the audience needs to choose wisely", "start": 68.95, "duration": 3.29}, {"text": "choose wisely on the journey of life. Honestly, it's not really that exciting or inspiring of an intro", "start": 73.32, "duration": 6.94}, {"text": "and knowing J. Cole I know that a lot of what this lady is saying is just gonna boil down to just", "start": 80.26, "duration": 4.78}, {"text": "Don't do the wrong thing just make sure you do the right thing", "start": 85.81, "duration": 4.129}, {"text": "So we transition into the track KOD, the title track of the album", "start": 90.299, "duration": 3.51}, {"text": "which is actually a decent tone setter for the record in that, it's a kind of sparse,", "start": 93.81, "duration": 4.949}, {"text": "somewhat eerie trap instrumental, a little unsettling but only vaguely", "start": 99.1, "duration": 4.19}, {"text": "hooks that barely sound like hooks and don't transition sonically or", "start": 103.75, "duration": 4.849}, {"text": "emotionally all that much from the verses, a kind of underwhelming vocal delivery and a general lack of focus across the songs themselves", "start": 109.45, "duration": 7.01}, {"text": "Which given the album cover here and given the title of the album", "start": 116.799, "duration": 4.04}, {"text": "which is like kids on drugs or king overdose", "start": 120.84, "duration": 3.3}, {"text": "you would think that this track specifically would be some kind of grand statement on substance abuse and", "start": 124.149, "duration": 5.809}, {"text": "addiction but some of the first bars he hits audiences with", "start": 130.5, "duration": 3.36}, {"text": "on this track is just him complaining about people wanting them to have more features on his records", "start": 133.86, "duration": 3.56}, {"text": "which just kind of comes off as bitter at the end of the day", "start": 137.48, "duration": 2.599}, {"text": "I mean I dig the overall vibe in the style of the track", "start": 140.079, "duration": 2.88}, {"text": "but once again Cole fails to pass the expectations test, and I don't mean merely", "start": 142.959, "duration": 4.68}, {"text": "my expectations or the expectations that his audience puts on him by hyping him up. I mean the actual expectations", "start": 148.159, "duration": 6.74}, {"text": "he puts on his own tracks with the song titles with the album cover with the messaging in the hooks", "start": 154.9, "duration": 5.86}, {"text": "because across J. Cole's discography I feel like there's always been J. Cole", "start": 160.76, "duration": 3.619}, {"text": "and then there is the reputation of J. Cole as this", "start": 164.379, "duration": 2.91}, {"text": "mega woke lyrical miracle with this laser focused intensity on whatever", "start": 167.75, "duration": 5.599}, {"text": "song topic or profound truth that he's dropping in a song", "start": 173.75, "duration": 3.079}, {"text": "when in actuality he's never truly been that at least not for longer than a song or two", "start": 176.93, "duration": 5.449}, {"text": "I mean there are certainly examples of that on this record but", "start": 182.379, "duration": 3.27}, {"text": "photograph is not one of them", "start": 186.889, "duration": 1.25}, {"text": "the song is basically an anthem for every Instagram creeper out there who falls in love at first sight with a picture of a woman", "start": 188.139, "duration": 5.73}, {"text": "totally overthinking the situation as if it's a situation at all", "start": 194.08, "duration": 3.36}, {"text": "\"what should I say, uh I hope I- I hope I can be this person's boyfriend\"", "start": 197.44, "duration": 4.919}, {"text": "It's a kind of creepy track when you get to the core of it", "start": 202.36, "duration": 2.58}, {"text": "It's sort of obsessive, like that weird little \"I'll keep this one to myself\" line", "start": 204.94, "duration": 6.08}, {"text": "in the hook is... I don't know", "start": 211.02, "duration": 2.64}, {"text": "it's it kind of makes the hairs on my neck stand up, not to mention the the subpar singing that Cole lays onto", "start": 213.669, "duration": 6.06}, {"text": "this track too, but the singing on this track is nowhere near that of \"kiLL edward\", the album's only featured", "start": 219.73, "duration": 6.899}, {"text": "\"artist\", and he's on the album twice", "start": 227.269, "duration": 2.63}, {"text": "I pretty much like the messaging in the sentiment of the song: Cole cutting people out of his life who have a toxic", "start": 229.9, "duration": 5.639}, {"text": "impact or are using him, not just in the present, but also reflecting on instances of this in the past, but truthfully", "start": 235.819, "duration": 7.279}, {"text": "it's one of the most hideous sounding songs on the entire record", "start": 243.1, "duration": 3.64}, {"text": "\"gimme drink, gimme smoke\nget me drunk, get me a drink\"", "start": 246.74, "duration": 3.44}, {"text": "also this bar on here about", "start": 250.18, "duration": 2.0}, {"text": "not fantasizing about murder because he's sane but he can't get away from this desire to hurt this person who he has in mind", "start": 252.229, "duration": 6.86}, {"text": "which like what", "start": 259.4, "duration": 1.19}, {"text": "what do you even call that? The song ATM is quite possibly the first", "start": 260.59, "duration": 3.54}, {"text": "truly enjoyable moment on the album, first track that really delivers any kind of thrill even with the beat not being the hardest even with", "start": 264.38, "duration": 6.989}, {"text": "the hook being as a redundant as it is it's really Cole's delivery and fast flow and passionate", "start": 271.37, "duration": 5.1}, {"text": "performance that ends up making this song", "start": 276.66, "duration": 2.209}, {"text": "I mean, it's not the smartest message or the most grandiose truth bomb or anything", "start": 278.87, "duration": 4.17}, {"text": "but the track essentially gets to this idea of of greed and materialism", "start": 283.04, "duration": 4.169}, {"text": "and not being able to take all these things that you gather on to the other side", "start": 287.46, "duration": 3.92}, {"text": "Cole also paints a character portrait of this person who benefits profits off the misfortune of others which is", "start": 291.57, "duration": 6.29}, {"text": "easily the more interesting segment of the song a lot like with Cole's last record I feel like I'm kind of getting hints", "start": 298.41, "duration": 5.57}, {"text": "I'm getting like references to an idea of a concept or something like I'm kind of getting flashes of this", "start": 303.98, "duration": 7.679}, {"text": "individual who is is being represented on the front cover over here", "start": 312.12, "duration": 3.35}, {"text": "but Cole doesn't follow through enough to kind of fill this record with I don't know enough", "start": 315.47, "duration": 5.22}, {"text": "internal monologues or points of view from this person to really stitch a cohesive project together", "start": 321.21, "duration": 5.839}, {"text": "where I don't know we kind of get to know this individual or", "start": 327.39, "duration": 4.07}, {"text": "whoever the heck he's supposed to be", "start": 332.52, "duration": 1.56}, {"text": "again on an album Cole has a potentially great point he could be making but it's convoluted by", "start": 334.08, "duration": 5.32}, {"text": "him trailing off into other directions just a general lack of focus", "start": 339.66, "duration": 4.08}, {"text": "the song \"motivate\", it's pleasant while it's on, but it's easily one of the sleepiest", "start": 343.74, "duration": 4.74}, {"text": "motivational songs ever, it's confusingly short as well", "start": 348.66, "duration": 3.17}, {"text": "It's not one of the worst tracks on this thing, but it's essentially a very taxing", "start": 351.83, "duration": 4.889}, {"text": "creepin anthem with Cole rapping about temptation", "start": 357.27, "duration": 2.869}, {"text": "and being unfaithful and and being a Mac when he's out on the road", "start": 360.69, "duration": 4.7}, {"text": "his real opinions and motions on the matter seem kind of vague and at the end of the day", "start": 365.39, "duration": 4.469}, {"text": "he just kind of seems moody because he can't have his cake and eat it too. And speaking of taxing, the song", "start": 369.86, "duration": 5.76}, {"text": "\"BRACKETS\" is literally about taxes. Another painfully boring track on this album", "start": 375.99, "duration": 5.33}, {"text": "not just aesthetically but also structurally: the beat is pretty drab", "start": 381.32, "duration": 4.0}, {"text": "and the song features these multiple vocals snippet passengers that take way too long to make J. Cole's point", "start": 385.32, "duration": 5.4}, {"text": "however the second verse on this record is quite possibly one of the most salient on the entire album", "start": 390.72, "duration": 5.08}, {"text": "I mean while it might seem far-fetched that J.Cole is rapping about an app on your phone", "start": 395.86, "duration": 4.22}, {"text": "where you pick where your tax dollars go, his bars about neighborhoods being taxed", "start": 400.1, "duration": 4.4}, {"text": "and simultaneously not seeing the benefit of that taxation are pretty strong", "start": 404.5, "duration": 4.02}, {"text": "talking about schools not making the grade, talking about roads not being fixed", "start": 408.52, "duration": 3.94}, {"text": "the song \"Once an Addict (interlude)\" is another high point on the album.", "start": 412.46, "duration": 3.58}, {"text": "The song features all of these bars about J. Cole's mom when he was younger in the throes of alcoholism", "start": 416.04, "duration": 5.64}, {"text": "he's about to go to college, he's not really knowing what to do about it, he wants to run away from it.", "start": 421.68, "duration": 4.4}, {"text": "It's easily one of the most powerful tracks he's ever recorded, period", "start": 426.08, "duration": 4.06}, {"text": "really projecting that pain through his pen my only letdown with the song is that it's", "start": 430.14, "duration": 5.16}, {"text": "categorized as a mere interlude when it's just as long and much more entertaining", "start": 435.3, "duration": 4.72}, {"text": "than a lot of the other songs on the record", "start": 440.1, "duration": 2.3}, {"text": "the song \"friends\" right after is a moment on the record where Cole goes deeper into the topic of drug abuse and", "start": 442.4, "duration": 5.52}, {"text": "Honestly Cole is not nearly as annoying or preachy on this topic as I thought that he might have been going into it", "start": 448.26, "duration": 6.079}, {"text": "He's certainly not on the level of a Russ", "start": 454.339, "duration": 1.84}, {"text": "but what ends up kneecapping this song is not only another set of awful vocals from \"kiLL edward\"", "start": 456.18, "duration": 8.02}, {"text": "but also that there's a great build-up", "start": 464.22, "duration": 2.2}, {"text": "but not much in the way of payoff because while in one breath Cole is going in on this track against politicians", "start": 466.429, "duration": 6.33}, {"text": "poverty, traumatized kids", "start": 473.639, "duration": 2.0}, {"text": "people with short-sighted goals like oh, \"I'm gonna be on the Pistons\"", "start": 475.8, "duration": 3.539}, {"text": "\"I'm gonna be a basketball player\"", "start": 479.34, "duration": 2.28}, {"text": "Cole says on this track that he would need 20 CDs to essentially get to the core of of", "start": 481.62, "duration": 4.24}, {"text": "everything rotting America from the inside out, so he takes all this stuff", "start": 486.239, "duration": 3.74}, {"text": "he rounds all of it up only to put a cherry on top and tell the audience", "start": 489.979, "duration": 3.599}, {"text": "\"Meditate don't medicate\", and I don't know maybe that message turns heads at a local dare program, or a food co-op", "start": 494.729, "duration": 6.769}, {"text": "but a lot of this stuff is systematic and in meant to ruin people's lives and create a class of citizen", "start": 501.539, "duration": 5.509}, {"text": "that is caught in the cycle of \"drugs crime poverty drugs crime poverty drugs crime poverty\"", "start": 507.12, "duration": 6.14}, {"text": "with our current drug war and how we treat addiction in this country", "start": 513.26, "duration": 3.48}, {"text": "the song \"windowpane\", I have a bit of a love-hate relationship with this track I mean", "start": 516.74, "duration": 4.34}, {"text": "the only thing truly awful about it is the title, beyond that the sentiment of the song is essentially Cole saying,", "start": 521.669, "duration": 6.409}, {"text": "\"I'm telling you guys all this good stuff", "start": 528.449, "duration": 2.09}, {"text": "I'm telling you what to do", "start": 530.73, "duration": 1.94}, {"text": "and what not to do and none of you are doing what I say none of you are listening to me\"", "start": 532.67, "duration": 5.04}, {"text": "which is a little desperate and it's most likely connected to Cole's ego in some way", "start": 537.71, "duration": 4.199}, {"text": "but I do feel his frustration and his anger at just a lack of positive change", "start": 541.91, "duration": 5.25}, {"text": "I agree with nearly everything he's saying and citing on this track, but the thing is at the end of the day", "start": 547.16, "duration": 5.04}, {"text": "the human race is flawed and people are going to make bad decisions, bad personal decisions", "start": 552.779, "duration": 5.27}, {"text": "You can't just merely wrap it or nag it out of your audience", "start": 558.32, "duration": 3.209}, {"text": "it's not going to happen all one could really hope for is that we create a better society where", "start": 561.57, "duration": 5.179}, {"text": "these bad decisions are less likely to happen and that we have better social safety nets for when these decisions occur", "start": 566.88, "duration": 6.54}, {"text": "again it's not that I hate Cole for trying. It's one of the few things that's truly admirable about him", "start": 573.42, "duration": 4.54}, {"text": "the issue is at the end of the day that a lot of these problems are bigger than him or really any of us individually", "start": 578.06, "duration": 5.78}, {"text": "and far beyond his reach", "start": 584.02, "duration": 1.86}, {"text": "even as a platinum-selling rapper", "start": 585.89, "duration": 1.86}, {"text": "I also love Cole's hypnotic flow on this track, the refrain on this cut is pretty", "start": 587.75, "duration": 4.5}, {"text": "cold-blooded as well", "start": 592.34, "duration": 1.2}, {"text": "Cole talking about wanting to see his relatives on the other side, hurt the man who hurt his mom", "start": 593.54, "duration": 4.8}, {"text": "and then we end things off at the track \"1985\" named after the year that J. Cole was born", "start": 598.34, "duration": 4.4}, {"text": "and a lot of people have been freaking out about this cut over the weekend saying", "start": 602.74, "duration": 3.12}, {"text": "\"it's a Lil Pump diss. He's dissing Lil Pump. Lil Pump responded, oh my God\"", "start": 605.86, "duration": 6.94}, {"text": "and this thing is not even a diss track, It's an advice track", "start": 612.8, "duration": 3.76}, {"text": "sure maybe the tone of the song is a little patronizing", "start": 616.56, "duration": 2.38}, {"text": "But J. Cole is smarter than a lot of the people who he's talking about and he's right", "start": 619.08, "duration": 4.52}, {"text": "this song features not only some of the smartest observations on the entire record, but some of the smartest commentary on rap right now", "start": 623.6, "duration": 6.2}, {"text": "We have how some of these new kids could be making more money in the industry", "start": 629.81, "duration": 3.27}, {"text": "Spending their money so that they have more longevity not only in in their music careers", "start": 633.6, "duration": 4.52}, {"text": "but also in life, telling these kids not to fall prey to the trends that they rode in on", "start": 638.12, "duration": 4.4}, {"text": "pulling them back into the ocean after the tide, you know, rolls back.", "start": 642.52, "duration": 3.48}, {"text": "And also how clueless white kids consume their music and view it as a window into authentic black culture", "start": 646.1, "duration": 6.16}, {"text": "and as bland as J. Cole can be sometimes what he says on this track about how long he's going to last", "start": 652.26, "duration": 4.56}, {"text": "in the industry is most likely true as long as he continues to provide this", "start": 656.839, "duration": 3.81}, {"text": "specific thing that appeals to this niche audience that loves them so much", "start": 660.98, "duration": 4.3}, {"text": "at the end of the day KOD is a lot like many other Cole records.", "start": 665.28, "duration": 4.82}, {"text": "there's a lot of heart, and there are some very good ideas here, but there's little to no ambition on this thing", "start": 670.1, "duration": 6.56}, {"text": "and Cole clearly thinks that just because he's past the very low bar of", "start": 676.66, "duration": 4.32}, {"text": "\"Well, I'm not making mindless crap\"", "start": 681.66, "duration": 3.38}, {"text": "he can merely come through the record that overall sounds very low energy, very low structure,", "start": 685.04, "duration": 5.44}, {"text": "very low everything and it's all gravy", "start": 690.48, "duration": 2.78}, {"text": "And I just don't get this insistence on a lack of features", "start": 693.26, "duration": 3.44}, {"text": "not that I think a flood of pop rappers would make this record any better", "start": 696.7, "duration": 3.6}, {"text": "But maybe some more outside input on his music would allow Cole to", "start": 700.38, "duration": 6.04}, {"text": "Collaborate with people who could, I don't know,", "start": 706.54, "duration": 2.72}, {"text": "fill in some of his musical blind spots of which there are quite a few", "start": 709.26, "duration": 3.76}, {"text": "Not really sure what else to say, I feel kind of indifferent, yet again, on another J. Cole album", "start": 713.129, "duration": 5.75}, {"text": "kind of torn because there are highs and there're lows here and really,", "start": 719.22, "duration": 5.299}, {"text": "that's what J. Cole just kind of tends to do, I guess. I'm feeling a strong 5 to a light 6 on this transition", "start": 725.069, "duration": 6.14}, {"text": "Have you given this album a listen? Did you love it? Did you hate it? What would you rate it?", "start": 731.209, "duration": 4.2}, {"text": "You're the best, you're the best, what should I review next", "start": 735.409, "duration": 1.731}, {"text": "hit the like if you like please subscribe and please don't please don't cry hit the bell as well over", "start": 737.14, "duration": 4.86}, {"text": "Here next to my head is another video you can check out hit that up or the link to subscribe to the channel Anthony Fantano", "start": 742.009, "duration": 5.489}, {"text": "forever", "start": 748.139, "duration": 2.0}]