[{"text": "Hi everyone, Anthony Fantano here,", "start": 0.0, "duration": 2.82}, {"text": "the Internet's busiest music nerd", "start": 2.82, "duration": 2.3}, {"text": "and it's time for a review of the new", "start": 5.46, "duration": 2.3}, {"text": "Earl Sweatshirt album", "start": 7.76, "duration": 1.82}, {"text": "Some Rap Songs. This is the third full length album", "start": 9.58, "duration": 2.82}, {"text": "from poet, song writer and abstract hip-hop word ninja, Earl Sweatshirt.", "start": 12.56, "duration": 5.56}, {"text": "It's been a few  years since we last heard from Earl in a studio album capacity, his 2015 record I Don't Like Shit I Don 't Go Outside was his last.", "start": 18.22, "duration": 9.12}, {"text": "That year was also the same when the hip-hop collective that helped pave his way to fame, Odd Future, had pretty much become defunct as a cohesive unit.", "start": 27.46, "duration": 9.28}, {"text": "Though Earl's absence from the group during their peak of hype kinda became a rallying cry across every corner of the internet.", "start": 36.74, "duration": 6.3}, {"text": "On music boards, on social media; every music publication under the sun", "start": 43.34, "duration": 3.76}, {"text": "as well as even traditional outlets like the New York Times", "start": 47.14, "duration": 2.96}, {"text": "Free him, free my boy Earl", "start": 50.28, "duration": 2.0}, {"text": "Free him now", "start": 52.42, "duration": 1.04}, {"text": "He's literally been free for like the past five years.", "start": 53.56, "duration": 4.02}, {"text": "We did it, we did it everybody", "start": 58.32, "duration": 2.78}, {"text": "We did it, good Job", "start": 61.36, "duration": 1.5}, {"text": "While Earl is a member of Odd Future and certainly a big reason as to why the group blew up", "start": 63.26, "duration": 4.28}, {"text": "there's always been something about him that's made him stand out amongst every other member in the group", "start": 67.98, "duration": 4.4}, {"text": "whether that be his literal geographic location", "start": 72.58, "duration": 2.6}, {"text": "Or his lyrical talent and attention to detail.", "start": 75.28, "duration": 2.6}, {"text": "Also, an uncompromising emotionally dark streak in his music.", "start": 78.38, "duration": 4.12}, {"text": "That not only made him stick out like a sore thumb in Odd Future, but really in the current hip-hop meta in general.", "start": 82.5, "duration": 6.54}, {"text": "And Earls anxieties, as well as his depression, have not been exactly a secret up unto this point", "start": 89.22, "duration": 6.0}, {"text": "They were on display in a big way on his last record and on top of it, earlier this year Earl canceled a entire European tour citing anxiety and depression as the reason why.", "start": 95.46, "duration": 9.44}, {"text": "Considering that I guessed months ago \"whatever Earl's next album is going to be will most likely be his darkest and maybe most dependent yet\"", "start": 105.04, "duration": 8.3}, {"text": "And the teaser tracks for this record like the Mint and Nowhere to Go certainly foretasted towards that", "start": 113.52, "duration": 5.44}, {"text": "Especially considering the songs gloomy lyrics, minimal structures and hypnotic experimental production", "start": 119.08, "duration": 4.66}]