[{"text": "[Cal Chuchesta jammin']", "start": 0.0, "duration": 2.72}, {"text": "[Anthony is not pleased]", "start": 2.72, "duration": 0.56}, {"text": "Hey everyone, SPAMtony SCAMtano here,\nthe Internet's busiest music nerd.", "start": 3.28, "duration": 7.22}, {"text": "And it's time for review of the new\nLemon Demon record, \"Spirit Phone\".", "start": 10.78, "duration": 5.82}, {"text": "Lemon Demon is the occasionally comedic, rock-and-pop project of producer, multi-instrumentalist and songwriter, mr. Neil Cicerega.", "start": 16.6, "duration": 9.98}, {"text": "The man is a jack of all trades, when\nit comes to Internet content creation.", "start": 26.58, "duration": 5.8}, {"text": "You might remember-r-r the legendary \"BRODYQUEST\" meme on his YouTube channel, he also has a series of great skits.", "start": 32.38, "duration": 6.6}, {"text": "The epic \"Computer Fighters\" video that he just dropped; also,\nyou can check out the Potter Puppet Pals series, that he's done.", "start": 38.98, "duration": 7.62}, {"text": "A couple years ago, he came up with two amazing mash-up records, which I still listen to, casually, to this day.", "start": 46.6, "duration": 6.96}, {"text": "[cough] This is what addiction feels like.", "start": 53.56, "duration": 2.8}, {"text": "And he's also dropped numerous Lemon Demon albums up until this point as well.", "start": 56.36, "duration": 4.16}, {"text": "And I checked out as many as I could,\nwhen I first found out about Neil.", "start": 60.52, "duration": 5.06}, {"text": "And I guess, my first impressions were, that\nthere were good intentions behind these projects,", "start": 65.58, "duration": 4.92}, {"text": "but a lot of the production was sort of flimsy,\nvery clearly, sort of a DIY thing.", "start": 70.5, "duration": 4.64}, {"text": "And, not even like, in a super-cool, hip, trendy, lo-fi way.", "start": 75.14, "duration": 5.2}, {"text": "More in a way, where the mixing feels kinda one-dimentional:", "start": 80.34, "duration": 3.96}, {"text": "the keyboards, the guitars, the percussion,\nthe vocals feel really raw, maybe slightly untouched.", "start": 84.3, "duration": 6.34}, {"text": "Placing instruments in a mix, can be a lot like arranging furniture in a room.", "start": 90.64, "duration": 5.28}, {"text": "And rather than placing everything tastefully,", "start": 95.92, "duration": 2.74}, {"text": "so that the room functions and it flows,\nand you could sort of move throughout i-i-it,", "start": 98.66, "duration": 4.08}, {"text": "it felt like everything was just kind of jumbled on top of each other.", "start": 102.74, "duration": 2.6}, {"text": "And this is somewhat of an issue on this latest\nLP for me as well, though not quite as much.", "start": 105.34, "duration": 6.88}, {"text": "It seems like Neil, on this one, has honed his production chops quite a bit, though they're not perfect -", "start": 112.22, "duration": 5.52}, {"text": "- I will say that I think, in terms of his songwriting,\nand what he puts into this record instrumentally", "start": 117.74, "duration": 7.0}, {"text": "(which is a lot, this is a pretty busy record),", "start": 124.74, "duration": 2.62}, {"text": "I feel like most of his ideas,\nor great deal of his ideas, translate.", "start": 127.36, "duration": 4.42}, {"text": "All the songs are really sharply written.\nI mean, some of the best hooks I've heard this year.", "start": 131.78, "duration": 4.42}, {"text": "If you like the quirk of bands like Devo, and the\nerratic vocals of a singer like Mark Mothersbaugh,", "start": 136.2, "duration": 7.18}, {"text": "or, you know, some of the weirdo dudes from the new wave era, like Gary Numan, or maybe you enjoy little They Might Be Giants,", "start": 143.38, "duration": 7.96}, {"text": "or, let's say, the Japanese synth-punk band Polysics, but\nsort of pulling the whole 8-bit sound out of the equation.", "start": 151.34, "duration": 9.02}, {"text": "Then I think you're gonna find something alike in this record.", "start": 160.36, "duration": 2.68}, {"text": "Neil isn't always making music to sound like these bands, but I do think there's a similar, playful attitu-u-u-ude.", "start": 163.04, "duration": 7.44}, {"text": "Musically, Neil pulls a lot from the 80s on this thing: new wave, pop-rock, there are lot of throbbing synthesizers-s-s, punchy danceable beats.", "start": 170.48, "duration": 8.86}, {"text": "Though it doesn't really sound clichéd, or vintaged, or just kind of trying to desperatly pull for some kind of nostalgia.", "start": 179.34, "duration": 8.44}, {"text": "Neil isn't trying to appeal to you with a throwback, he is\ntrying to get you to enjoy the songs, for what they are.", "start": 187.78, "duration": 5.86}, {"text": "And, I guess, occasionally wow you with a very strange song subject, like on the song \"Cabinet Man\",", "start": 193.64, "duration": 5.76}, {"text": "which seems to be about a guy,\nthat gets sucked into an arcade machine,", "start": 199.4, "duration": 4.72}, {"text": "and now he is part-man, part-machine,\nand exists in this weird videogame world.", "start": 204.12, "duration": 6.34}, {"text": "Now, this thing is 14 tracks long, but if you buy the full length album on Bandcamp, you get like 13 additional bonus tracks;", "start": 210.46, "duration": 7.06}, {"text": "which consist of demos, of some loose... just change,\nodds and ends that didn't make it onto the record.", "start": 217.56, "duration": 7.48}, {"text": "Some of which are actually pretty cool.", "start": 225.04, "duration": 1.56}, {"text": "The record features a really big intro track, a kind of, bit of a subtle, warm goodbye for the outro, that...", "start": 226.6, "duration": 7.2}, {"text": "at first I thought it was kind of a dud, but I guess with extra listens, it has grown on me.", "start": 233.92, "duration": 5.38}, {"text": "And there doesn't seem to be a grand concept to this entire project,", "start": 239.3, "duration": 4.66}, {"text": "even though right after the first track,\nthe whole thing kicks off with a PSA,", "start": 243.96, "duration": 4.16}, {"text": "where Neil is saying - due to his strong convictions - he has to say, that", "start": 248.12, "duration": 4.52}, {"text": "\"This record is not endorsing the occult\".", "start": 252.64, "duration": 3.2}, {"text": "And I guess there are some occult, and very morbid - hilariously morbid - moments on this thing, that we'll get into;", "start": 255.84, "duration": 6.54}, {"text": "but for the most part, this record is just all about...\neach song on here just standing so well on its own,", "start": 262.38, "duration": 7.3}, {"text": "as uh, potentially, like a good single.", "start": 269.68, "duration": 2.56}, {"text": "I mean, we're just talkin' great verses and\nchoruses here, just very tightly written songs.", "start": 272.24, "duration": 4.24}, {"text": "Hooks so good, I get a rush off of them.", "start": 276.5, "duration": 2.78}, {"text": "Uh, one of my favourite tracks here is, right toward the\nbeginning: \"On a touch-tone, touch-tone, telephone!\"", "start": 279.28, "duration": 5.74}, {"text": "I love the punchy pianos on this thing, the really sweet \"kisses\" of string embellishments, that are worked into the hook too.", "start": 285.02, "duration": 7.28}, {"text": "This thing is as hard-hitting, and as infectious, as\nit is just really detailed, and intricate, and refined.", "start": 292.3, "duration": 5.94}, {"text": "And uh, lyrically, the song is about... supernatural calls?", "start": 298.24, "duration": 4.98}, {"text": "Calling, talking to people from beyond the grave,\nwhile simultaneously saluting old technology.", "start": 303.22, "duration": 6.22}, {"text": "You know, Neil just tosses out references to things like\ncircuitboards, and Leonard Nimoy, like it's nothin'.", "start": 309.44, "duration": 7.26}, {"text": "The song \"Sweet Bod\" is one of my favoutite tracks here,\nbut simultaneously, one of the most unsettling, uhh...", "start": 316.7, "duration": 6.24}, {"text": "Neil seems to have some kind of attraction to, uh, a\ndead body here, or some specific person's dead body.", "start": 322.94, "duration": 7.0}, {"text": "And he's not trying to have sex with the body or anything like that, it's not a necrophilia thing, it's not...", "start": 329.94, "duration": 5.42}, {"text": "sexual, as he says in the song.", "start": 335.36, "duration": 2.2}, {"text": "But he wants to, sort of, cover the body in honey\nand sweet things, and make it \"confectional\"?", "start": 337.78, "duration": 7.44}, {"text": "It's a candy cadaver! It's a candy cadaver. And um,\nI guess he just wants to mummify this body, in uh, sugar.", "start": 345.22, "duration": 6.92}, {"text": "[Anthony is confused] Eh?", "start": 352.14, "duration": 2.38}, {"text": "I like the song \"When He Died\", it took a little to grow on me, but I'm getting like a serious Unicorns vibe off this song,", "start": 354.52, "duration": 6.76}, {"text": "especially with some of the very frail lead vocals,\nand the very morbid topic of the track.", "start": 361.28, "duration": 7.14}, {"text": "The song \"Ancient Aliens\"\n(♩ ♫ ti ti, paa, NAAH, naah ♬ ♪) -", "start": 368.42, "duration": 3.94}, {"text": "- has some of the most searing, and just bright,\nand catchy synth leads of the entire project.", "start": 372.36, "duration": 4.96}, {"text": "Then there's the song \"Soft Fuzzy Man\", which...", "start": 377.32, "duration": 3.7}, {"text": "I mean, if a soft, fuzzy man is anywhere near\nas fun as the song, I'm interested! Sign me up.", "start": 381.02, "duration": 5.76}, {"text": "On \"As Your Father I Expressly Forbid It\", Neil plays\nthis really neurotic character, that reads to me like a...", "start": 386.78, "duration": 7.32}, {"text": "from an old Talking Heads or like a David Burn song,\nand Neil seems to literally be playing his dad,", "start": 394.1, "duration": 5.72}, {"text": "or a dad, on this track, sort of scolding his son,", "start": 399.82, "duration": 3.76}, {"text": "for: talking to his grandfather about the Internet, his grandfather doesn't know what the Internet is, he doesn't care.", "start": 403.58, "duration": 5.26}, {"text": "And he doesn't want his kid to be bringing his Gameboy to his table.", "start": 408.84, "duration": 3.12}, {"text": "Uh, he seems to be yelling at his kid, after he\nmisplaces his dad's medicine, or something;", "start": 411.96, "duration": 6.34}, {"text": "and his dad gets mad at him for it.\n\"As your father, I expressly forbid it!\"", "start": 418.3, "duration": 3.66}, {"text": "And, Neil stays on, sort of that family\ntheme, on the song \"I Earn My Life\",", "start": 421.96, "duration": 4.94}, {"text": "uh, which is, sort of an intimate\nand vulnerable moment for him.", "start": 426.9, "duration": 5.04}, {"text": "Uh, sort of seems to add up to this idea,\nthat was placed by the last track;", "start": 431.94, "duration": 5.54}, {"text": "that I guess, family life, home life,\ncan kind of be a prison, in a way.", "start": 437.48, "duration": 5.2}, {"text": "Or at least, that's how I read it.", "start": 443.54, "duration": 1.6}, {"text": "And then, Neil dives into the\ntopsy-turvy world of economics,", "start": 445.14, "duration": 3.9}, {"text": "on the song \"Reaganomics\", where - I guarantee,\nthis will be the only song you hear this year,", "start": 449.04, "duration": 5.54}, {"text": "where a singer goes:\n ♬ ♫ \"DEREGULATION, baby!\" ♪ ♫", "start": 454.58, "duration": 4.42}, {"text": "Though, I do think the song comes off really loud,\nsuper punchy, to the point where, uhh,", "start": 459.0, "duration": 4.68}, {"text": "I think, everything... This is just another mix,\nwhere the keys, the beats, everything is just so loud,", "start": 463.68, "duration": 5.68}, {"text": "and so piled on top of each other, that it's uh...\nIt's a little oppressive to listen to.", "start": 469.36, "duration": 4.02}, {"text": "But lyrically, I enjoy what Neil is doing with the song, basically umm...", "start": 473.38, "duration": 3.76}, {"text": "talking about his wish, to\n\"free the world of the burden of money\".", "start": 477.14, "duration": 4.02}, {"text": "And I like, that Neil is able to occasionally work in a soft side on this record too.", "start": 481.16, "duration": 5.24}, {"text": "Like on a closer, or uh, toward the start of the song \"No Eyed Girl\".", "start": 486.4, "duration": 4.1}, {"text": "Not only does this track feature plenty of cowbell, but some vocal harmonies,", "start": 490.5, "duration": 3.92}, {"text": "that seem sort of Queen-inspired. Really cool.", "start": 494.42, "duration": 2.64}, {"text": "This record, again, is just a straightforward pop-rock record,", "start": 497.06, "duration": 3.48}, {"text": "with some great hooks, some good writing,\nsome really creative lyrics, and a lot of persona-a-a-ality.", "start": 500.54, "duration": 4.96}, {"text": "It's got a New Wave vibe to it, with a fast, punchy punk energy, but it still stays accessible.", "start": 505.5, "duration": 5.1}, {"text": "Occasionally, the production can be a little messy, a little loud,", "start": 510.6, "duration": 3.42}, {"text": "and maybe this record might read to you as slightly obnoxious too.", "start": 514.02, "duration": 3.18}, {"text": "There is something about this album,\nthat- that is just painfully nerdy.", "start": 517.2, "duration": 4.28}, {"text": "But uh, that does appeal to me,\nit may not appeal to you.", "start": 521.48, "duration": 3.82}, {"text": "And, I think we're gonna leave it there.\nI'm feelin' a strong 7 to a light 8, on this thing. Tran-", "start": 525.3, "duration": 5.92}, {"text": "-sition!\nHave you given this album a listen?", "start": 531.22, "duration": 2.9}, {"text": "Did ya love it, did ya hate it,\nwhat would you rate it?", "start": 534.12, "duration": 2.18}, {"text": "You the best, you the best,\nwhat should I review next?", "start": 536.3, "duration": 2.0}, {"text": "Hit-that-like,\nif-you-like,", "start": 538.3, "duration": 2.02}, {"text": "Spirit Phone,\nwant to... bone (?)", "start": 540.32, "duration": 3.56}, {"text": "UGGGghhh...\nThanks for the album, Neil! It's really fun.", "start": 543.88, "duration": 3.82}, {"text": "And thanks for watching,\nyou guys are the best. Forever!", "start": 550.7, "duration": 2.76}]