[{"text": "Hi everyone, Anthony Fantano here, internet's busiest music nerd", "start": 0.0, "duration": 3.54}, {"text": "and it's time for a review of the new Cardi B album \"Invasion Of Privacy\".", "start": 3.88, "duration": 4.66}, {"text": "Straight out of the Bronx it's Cardi B, reality star, internet and social media icon, rapper.", "start": 8.84, "duration": 7.2}, {"text": "Cardi's rise to mainstream fame in the past year has been meteoric to say the least.", "start": 16.04, "duration": 5.16}, {"text": "Her stripper to rap superstar transition has been explosive, and pretty much unparalleled.", "start": 21.3, "duration": 6.24}, {"text": "Her breakout single \"Bodak Yellow\" gained momentum very slowly over the course of the summer", "start": 27.54, "duration": 4.76}, {"text": "of 2017 and beyond, and she has dropped numerous chart toppers since.", "start": 32.3, "duration": 4.64}, {"text": "And her new record over here went gold the day of release.", "start": 37.04, "duration": 4.36}, {"text": "She has pretty much outlasted all claims that she is just a one hit wonder,", "start": 41.4, "duration": 4.14}, {"text": "and that her fifteen minutes of fame are almost up,", "start": 45.54, "duration": 2.9}, {"text": "and believe it or not, \"Invasion Of Privacy\" is actually not that bad.", "start": 48.44, "duration": 3.5}, {"text": "I mean I'm not going to say it's amazing or anything, but it's just good enough to where it would stave off", "start": 51.94, "duration": 4.72}, {"text": "claims that she's fallen off or that she doesn't have any long game.", "start": 56.66, "duration": 4.3}, {"text": "Because over all this thing is pretty consistent", "start": 60.96, "duration": 2.06}, {"text": "and even the spots that I don't care for will most likely go over well with her fans.", "start": 63.02, "duration": 4.5}, {"text": "But first let me try to get into the appeal of Cardi B.", "start": 67.92, "duration": 3.44}, {"text": "Obviously Cardi's music isn't particularly smart or flashy or experimental or whatever", "start": 71.36, "duration": 5.36}, {"text": "and most likely every track on this record is heavily reliant on Cardi's co-songwriters", "start": 76.72, "duration": 5.14}, {"text": "as well as her producers. With all of that being said, Cardi represents more than your average", "start": 81.86, "duration": 5.26}, {"text": "pop, trap, or soundcloud rapper right now. Because on this record she is an authoritative, sexually empowered,", "start": 87.12, "duration": 6.18}, {"text": "woman with this rag to riches story that nearly every American dreams of.", "start": 93.3, "duration": 4.6}, {"text": "Which in a way I think hits harder than it does for a lot of other artists out there", "start": 97.9, "duration": 3.8}, {"text": "because Cardi's past in dancing, in television, in these kind of shoddy mix tapes that she was dropping", "start": 101.82, "duration": 7.86}, {"text": "a little while back, has all been so well documented online.", "start": 109.68, "duration": 3.32}, {"text": "Because before Cardi blew up in the music industry, most people online already knew about her", "start": 113.0, "duration": 4.92}, {"text": "as just being this funny, goofy, silly, social media personality", "start": 117.92, "duration": 3.9}, {"text": "that nobody really needed to take that seriously.", "start": 121.82, "duration": 2.66}, {"text": "But since \"Bodak Yellow\" and the release of this album it's all of a sudden like", "start": 124.48, "duration": 3.26}, {"text": "'Woah, you've really like glowed up'.", "start": 127.74, "duration": 3.72}, {"text": "Another thing that adds to the appeal of Cardi is that her rough and unfiltered personality", "start": 131.46, "duration": 4.28}, {"text": "is so magnetic. I mean, the lyrics on this album range from being hilarious to being brash", "start": 135.92, "duration": 6.8}, {"text": "to being vulnerable. Even a little edgy with the multiple allusions to gang culture and specifically", "start": 142.94, "duration": 7.32}, {"text": "the bloods on this thing. I mean this album cover isn't red or anything but still the content within is", "start": 150.26, "duration": 5.92}, {"text": "about as bloodied up as YG's \"Still Brazy\".", "start": 156.18, "duration": 2.32}, {"text": "And generally Cardi B just seems way less calculated than a lot of other artists", "start": 158.5, "duration": 4.22}, {"text": "who manage to hit the mainstream, typically as a result of working at it for years and years and years", "start": 162.72, "duration": 4.92}, {"text": "and going through this very slow and very measured grooming process.", "start": 167.64, "duration": 4.5}, {"text": "Not that Cardi hasn't been working in the industry or trying to make her way up for a long time, she has,", "start": 172.14, "duration": 5.1}, {"text": "but in the areas of social media and reality television it's the exact opposite of reserved and calculated", "start": 177.48, "duration": 7.34}, {"text": "that gets you views and gets you attention. Given that background, given that experience", "start": 184.82, "duration": 4.96}, {"text": "it very much paints her approach to music and paints her approach to I guess just showcasing herself", "start": 189.94, "duration": 6.64}, {"text": "in the public eye. And I make that point not just as Cardi B as a female artist but I feel like generally", "start": 196.58, "duration": 5.42}, {"text": "male artists are a bit more I guess calculated as well.", "start": 202.04, "duration": 4.18}, {"text": "So this thing is thirteen tracks, its forty minutes", "start": 206.22, "duration": 2.88}, {"text": "I very much appreciate that for a debut it does not overstay its welcome.", "start": 209.24, "duration": 4.8}, {"text": "And it pretty much seems like the name of the game on this track list is to pen as many bangers", "start": 214.04, "duration": 4.64}, {"text": "and highlights as possible. This thing kicks off with the track \"Get Up 10\"", "start": 218.68, "duration": 3.42}, {"text": "which is a dramatic makeover anthem with a lot of lyrics about where Cardi came from, where she is now", "start": 222.1, "duration": 6.38}, {"text": "the track shows a lot of heart for her roots and her family but also a lot of New York grit.", "start": 228.48, "duration": 4.72}, {"text": "And I just kind of love that ending refrain where she talks about getting knocked down nine times", "start": 233.2, "duration": 4.0}, {"text": "but then getting up ten, it really kind of says a lot about Cardi as an artist and basically the theme of this album", "start": 237.2, "duration": 5.62}, {"text": "in general. That will for Cardi to push and succeed, move forward.", "start": 242.82, "duration": 4.28}, {"text": "However, it does't take too long for this record to just totally go off the rails and get insane.", "start": 247.1, "duration": 5.28}, {"text": "And what I mean is the song \"Bickenhead\"", "start": 252.5, "duration": 3.54}, {"text": "which is the most bad bitch anthem I've ever heard in my entire life.", "start": 256.12, "duration": 4.48}, {"text": "Cardi's sense of humor and charisma on this track are incredible, this track in a lot of ways is about the power", "start": 260.6, "duration": 6.82}, {"text": "the power of sex. Every bar on this track is about something sexual, just straight fucking", "start": 268.74, "duration": 6.0}, {"text": "she really kind of takes rapping about pussy popping to a new level.", "start": 274.94, "duration": 4.48}, {"text": "Pussy popping at church, pussy popping on the stove.", "start": 279.5, "duration": 3.52}, {"text": "I'm having a hard time talking right now because I had a near heart attack thinking about the line", "start": 283.02, "duration": 5.46}, {"text": "where she's talking about making that pussy crack a smile.", "start": 288.48, "duration": 3.76}, {"text": "Yeah, that's that's not something you hear every day. And moments like this are just the tip of the iceberg", "start": 292.24, "duration": 4.32}, {"text": "when it comes to the unrefined extravagance and exaggeration that Cardi brings to this album.", "start": 296.62, "duration": 6.84}, {"text": "Whether she's rapping about a Versace driveway or putting a Louis Vuitton shoe on some", "start": 303.46, "duration": 5.1}, {"text": "trash talking girl's neck. She's rapping about a threesome with Rhianna.", "start": 308.56, "duration": 4.4}, {"text": "Pussy so good she screams her own name. Also calling herself hot 'n ready like a Little Cesear's pizza.", "start": 313.14, "duration": 7.36}, {"text": "I hope you got a check for that.", "start": 320.64, "duration": 1.98}, {"text": "And also like Cardi is just the queen of shit talking on this record like this one bar about how this", "start": 322.62, "duration": 7.44}, {"text": "girl is saying that you know everything down there it's all her, it's all hers, but then she brings up that", "start": 330.06, "duration": 4.54}, {"text": "her thighs don't match, like they're different sizes, they don't look the same.", "start": 334.6, "duration": 2.82}, {"text": "*melon inhales sharply* ouch", "start": 337.42, "duration": 2.0}, {"text": "I also love this one bar where she says some guy is a pussy and a rat like Tom and Jerry.", "start": 339.42, "duration": 4.44}, {"text": "On a lot of these tracks, self written or not, it just feels like Cardi is putting on a masterclass in the", "start": 343.86, "duration": 7.02}, {"text": "hard-hitting, just totally no apologies, no shame, no holds barred verbal nastiness", "start": 350.96, "duration": 7.44}, {"text": "that New Yorkers are known for.", "start": 358.4, "duration": 1.94}, {"text": "The song \"Bodak Yellow\" is obviously in the track listing on this thing, what else can I say about this track", "start": 360.34, "duration": 4.74}, {"text": "that hasn't been said a million times before. It's easily one of the most cold and deadly", "start": 365.08, "duration": 4.3}, {"text": "trap bangers of the decade. And sure, while instrumentally the production on this thing", "start": 369.38, "duration": 4.16}, {"text": "might just be trap 101 and Cardi's flow on this track may just be an interpolation of a Kodak Black flow,", "start": 373.54, "duration": 6.34}, {"text": "but Cardi, with her personality, really sells the track.", "start": 380.06, "duration": 3.84}, {"text": "I mean a lot of new contemporary pop rap and trap right now it's all about personality, it's all about presence", "start": 383.9, "duration": 6.52}, {"text": "it's a personality contest and Cardi, if it's gonna be a competition on a personality level", "start": 390.42, "duration": 6.06}, {"text": "she brings that just", "start": 396.54, "duration": 1.86}, {"text": "*melon yells*", "start": 398.5, "duration": 0.9}, {"text": "When it comes to personality, when it comes to accent, when it comes to recognizability", "start": 399.4, "duration": 4.72}, {"text": "she just like goes super [saying?]", "start": 404.12, "duration": 2.32}, {"text": "And something that makes that work in my opinion is just that a lot of Cardi's rapping feels like", "start": 406.44, "duration": 4.58}, {"text": "she's kind of inviting her fans in on celebrating her success with her, as opposed to just trying to", "start": 411.02, "duration": 5.02}, {"text": "blow out everyone within ear and eye shot regardless of whether or not they're a fan", "start": 416.04, "duration": 3.74}, {"text": "which is especially true on the track \"Best Life\".", "start": 419.78, "duration": 2.76}, {"text": "which is a moment where Chance The Rapper really steals the show.", "start": 422.54, "duration": 3.24}, {"text": "His melodic very uppity very animated flow is here in spades.", "start": 425.82, "duration": 4.92}, {"text": "*melon sings* I'm living my best life", "start": 430.74, "duration": 1.76}, {"text": "and you know that vocal line is incredible, but Cardi certainly holds her own on the track.", "start": 432.5, "duration": 4.28}, {"text": "She is very different in terms of style and performance and delivery than Chance is", "start": 436.78, "duration": 4.48}, {"text": "and you know again just that kind of gritty, nasty, unfiltered New York personality just kind of", "start": 441.48, "duration": 6.4}, {"text": "pours through here, but there's a nice sense of positivity to this track that I feel like was much needed", "start": 447.88, "duration": 5.46}, {"text": "at the middle point of this thing. The song \"Be Careful\" believe it or not has grown on me", "start": 453.34, "duration": 4.32}, {"text": "since I initially heard it and had kind of a negative reaction to it.", "start": 457.66, "duration": 3.16}, {"text": "And Cardi's transition into a more emotional angle on this track, it's a bit awkward.", "start": 460.82, "duration": 4.8}, {"text": "But in a way, with Cardi B, her imperfections are kind of her strengths.", "start": 465.84, "duration": 4.72}, {"text": "Which is something that she even seems to be self aware of as she brings up her crib being messy,", "start": 470.56, "duration": 5.06}, {"text": "her hair being fucked up, or having messed up teeth which she later got fixed but there was a long", "start": 475.62, "duration": 5.1}, {"text": "period of time where her teeth were not in the best shape.", "start": 480.78, "duration": 4.14}, {"text": "But to even reference that in her own music so many times kind of continues, maybe inadvertently,", "start": 484.92, "duration": 5.66}, {"text": "this theme of self improvement and just kind of continuing to work on yourself so that you can be that", "start": 490.58, "duration": 4.98}, {"text": "best person you can be, you can kind of also be on that Cardi B track to success.", "start": 495.62, "duration": 5.26}, {"text": "Now unfortunately, after the middle point of this album, the quality kind of trails off a little bit.", "start": 500.88, "duration": 5.66}, {"text": "One, because some of the guests are a little underwhelming and two, because at this point", "start": 506.54, "duration": 5.24}, {"text": "Cardi B is still not that versatile of a rapper.", "start": 511.78, "duration": 3.08}, {"text": "The song \"I Like It\" is this latin trap flip featuring a prominent sample of the song \"I Like It Like That\"", "start": 514.86, "duration": 6.52}, {"text": "I think The Blackout Allstars version of the track, I could be wrong, could be the original", "start": 521.38, "duration": 4.14}, {"text": "at least that's the version I remember from when I was a kid.", "start": 525.52, "duration": 2.86}, {"text": "As far as Cardi's flow, her lyrics, and the instrumental goes, the track goes over great.", "start": 528.38, "duration": 4.56}, {"text": "Bad Bunny on the track is pretty fine even though I'm not really a huge fan of some of the latin trap", "start": 532.94, "duration": 5.84}, {"text": "crooners that have been making the rounds recently.", "start": 538.78, "duration": 3.08}, {"text": "What's for sure is he has more personality than J Balvin, who in my opinion really kind of just extends the track", "start": 541.86, "duration": 6.2}, {"text": "out a little bit too much, like his addition to the song was really unnecessary.", "start": 548.06, "duration": 4.54}, {"text": "Though I get given Cardi's background and the flavor of the song you would want to try to invite", "start": 552.6, "duration": 4.7}, {"text": "as many relevant people to that sound as possible to a track like this, it's all marketing.", "start": 557.3, "duration": 5.08}, {"text": "It's certainly better than it could've been.", "start": 562.38, "duration": 1.96}, {"text": "Balvin just seemed unnecessary because his vocals in my opinion, not that distinct,", "start": 564.34, "duration": 4.02}, {"text": "and Bad Bunny already outshined him on the track.", "start": 568.36, "duration": 2.36}, {"text": "The song \"Ring\" with Kehlani, I just do not care for Kehlani's vocals on this track at all", "start": 570.72, "duration": 4.82}, {"text": "they sound super sanitized, generic, dime a dozen, I wouldn't even know it was Kehlani if you didn't tell me.", "start": 575.54, "duration": 6.58}, {"text": "\"Money Bag\" is maybe the most unnecessary track on the entire record.", "start": 582.12, "duration": 3.5}, {"text": "Not only because the production is some of the most basic on the entire project,", "start": 585.62, "duration": 3.9}, {"text": "the hook is incredibly annoying, and on top of that Cardi's flow on here is pretty much just a repeat", "start": 589.52, "duration": 6.3}, {"text": "of her flow from \"Bodak Yellow\".", "start": 595.86, "duration": 2.16}, {"text": "It's like her and her producers were essentially trying to you know, go for \"Bodak Yellow\" number two.", "start": 598.02, "duration": 6.12}, {"text": "But making their attempts at just repeating the same formula a little too obvious.", "start": 604.14, "duration": 4.74}, {"text": "In my opinion, \"Bartier Cardi\" is a much better attempt at trying to get another weird, dark, trap hit", "start": 609.26, "duration": 7.02}, {"text": "brewing, which obviously worked because this song went number one as well,", "start": 616.28, "duration": 3.32}, {"text": "but in their attempts to make this happen it wasn't that obvious, it's not like they were literally copying", "start": 619.6, "duration": 6.92}, {"text": "and pasting the formula onto another song.", "start": 626.52, "duration": 2.6}, {"text": "SZA totally kills it on the closer.", "start": 629.12, "duration": 2.54}, {"text": "Her vocals are fantastic, some of the most aggressive and animated I've heard her on any track ever,", "start": 631.66, "duration": 5.4}, {"text": "but as far as a closing track this song to me really doesn't work all that well.", "start": 637.12, "duration": 5.12}, {"text": "This track thematically I think could have fit into numerous points of the album", "start": 642.24, "duration": 4.26}, {"text": "and it would've sounded just the same.", "start": 646.5, "duration": 1.42}, {"text": "Not to mention at this point on the album Cardi's delivery and flow, even though she does have some", "start": 647.92, "duration": 4.68}, {"text": "of her funniest lines on this song is kind of running a little thin for me,", "start": 652.6, "duration": 4.5}, {"text": "like she could use a bit of a change up at this point.", "start": 657.1, "duration": 2.82}, {"text": "\"Drip\" with Migos in my opinion is really weighed down by the Migos themselves", "start": 659.92, "duration": 4.34}, {"text": "as this performance here seems just as average as nearly every other performance they seem to give,", "start": 664.26, "duration": 5.16}, {"text": "on most features and most albums that they appear on these days.", "start": 669.42, "duration": 3.72}, {"text": "And then when it comes to the track \"She Bad\" with YG, easily one of the most tedious hooks", "start": 673.14, "duration": 5.42}, {"text": "on the entire record. I wish YG had like a more prominent or interesting feature on this thing,", "start": 678.56, "duration": 5.28}, {"text": "more interesting than", "start": 683.84, "duration": 1.24}, {"text": "*melon sings* she bad, she bad, she bad, she bad", "start": 685.08, "duration": 3.1}, {"text": "Louis bag, Louis bag, Fendi bag, Fendi bag", "start": 688.38, "duration": 2.8}, {"text": "*sings gibberish*", "start": 691.3, "duration": 1.62}, {"text": "Really the best moment on the back end of this record in my opinion is the song \"Thru Your Phone\"", "start": 692.92, "duration": 4.48}, {"text": "featuring Ali Tamposi, whose name I hope I'm pronouncing correctly, I apologize if I'm not", "start": 697.4, "duration": 3.96}, {"text": "but she's singing along with Cardi on the hook of this track and it's easily one of the best guest vocals", "start": 701.36, "duration": 4.82}, {"text": "on the entire record. I wish she had a credit right there on the title because her voice has this kind of very", "start": 706.18, "duration": 4.86}, {"text": "dreamy, pillowy, sad, moody demeanor that makes the song go over so well because Cardi's voice", "start": 711.5, "duration": 6.8}, {"text": "she's a little bit like a bull in a china shop. It's hard for her to convey super emotional tracks really well sometimes.", "start": 718.92, "duration": 6.6}, {"text": "And this track in particular was one of the more interesting when it comes to relationships on the rocks", "start": 725.52, "duration": 4.72}, {"text": "and this bitterness, this sense of betrayal that she feels.", "start": 730.24, "duration": 3.5}, {"text": "But this track is still one of the more interesting on the entire record when it comes to love on the rocks.", "start": 733.74, "duration": 4.8}, {"text": "It's not like be careful with me, that's a little bit more, I guess introspective with Cardi rapping about", "start": 738.54, "duration": 5.42}, {"text": "feeling insecure, feeling a lot of self doubt because the other person in the relationship isn't treating her right.", "start": 743.96, "duration": 5.5}, {"text": "This track \"Thru Your Phone\" is a little bit more nasty and bitter, a track where she's seeking vengeance", "start": 749.46, "duration": 6.16}, {"text": "over the fact that this person has just thrown her trust out of the window through their infidelity on their phone.", "start": 756.08, "duration": 6.82}, {"text": "Even though this album was a little bit of a mixed bag, it's not that bad of a commercial debut,", "start": 762.9, "duration": 4.9}, {"text": "it's a decent first outing.", "start": 767.8, "duration": 1.6}, {"text": "And like I said the tracks I didn't care for too much will most likely go over well with Cardi's fans", "start": 769.4, "duration": 4.34}, {"text": "but still with what she's presented here, I kind of feel like, I don't know, maybe down the road she could", "start": 773.74, "duration": 5.42}, {"text": "get a bit more interesting, maybe she could kind of work out some of these kinks and become a better rapper.", "start": 779.16, "duration": 5.3}, {"text": "I'm feeling a decent to strong six on this record. Tran-", "start": 784.46, "duration": 3.4}, {"text": "sition, have you given this album a listen?", "start": 787.86, "duration": 2.06}, {"text": "Did you love it, did you hate it? What would you rate it?", "start": 789.92, "duration": 2.2}, {"text": "You're the best, you're the best, what should I review next?", "start": 792.12, "duration": 2.52}, {"text": "Hit the like if you like, please subscribe, please don't die", "start": 794.64, "duration": 3.46}, {"text": "hit the bell as well and I will see you in the next one.", "start": 798.14, "duration": 3.44}, {"text": "Anthony Fantano, Anthony Fantano, Anthony Fantano, forever.", "start": 801.72, "duration": 4.24}]