[{"text": "Ahhh, Ahhh", "start": 0.0, "duration": 1.84}, {"text": "Hi everyone, Longthony Waittano here,", "start": 2.04, "duration": 4.32}, {"text": "the internet's busiest music nerd.", "start": 6.36, "duration": 1.84}, {"text": "And it's time for a review of the new Tyler, the Creator Album, IGOR.", "start": 8.44, "duration": 4.8}, {"text": "This is the sixth full-length album from one of the most polarizing and uncompromising", "start": 13.24, "duration": 6.08}, {"text": "rappers and producers of this generation, Tyler, the Creator.", "start": 19.32, "duration": 5.66}, {"text": "It has been a few years now since the release of Tyler's most critically-acclaimed album yet, Flower Boy.", "start": 24.98, "duration": 5.96}, {"text": "Which was a pretty amazing moment for him in his discography.", "start": 30.94, "duration": 3.88}, {"text": "Easily his most consistent record yet in-terms of style and quality.", "start": 34.82, "duration": 5.04}, {"text": "Better production and lyrics on this thing, quality features as-well as smooth fusions of hip-hop and soul", "start": 39.86, "duration": 5.68}, {"text": "throughout almost every instrumental here.", "start": 45.54, "duration": 2.14}, {"text": "Not only was Tyler writing some of his best songs to date on this album,", "start": 47.68, "duration": 5.02}, {"text": "but a lot of the amateurish and childishly edgy characteristics of his past works", "start": 52.7, "duration": 5.62}, {"text": "that really held his music back, kind of melted away.", "start": 58.32, "duration": 3.22}, {"text": "It's like a switch was flipped and we were being presented with an all-new Tyler here.", "start": 61.54, "duration": 3.94}, {"text": "And IGOR presents us with a brand-new Tyler, the Creator as-well", "start": 65.48, "duration": 4.8}, {"text": "Like a few of Tyler's previous projects IGOR sees our hip-hop anti-hero", "start": 70.28, "duration": 4.8}, {"text": "embracing a new character and a new narrative.", "start": 75.08, "duration": 2.84}, {"text": "IGOR is more than just another persona though, it's also a vehicle for Tyler to express his heartbreak", "start": 77.92, "duration": 5.58}, {"text": "and explore more singing and tuneful song-writing.", "start": 83.5, "duration": 2.72}, {"text": "Flower Boy definitely saw Tyler gravitating more towards these sounds", "start": 86.22, "duration": 3.8}, {"text": "and maybe with his next record some of his long-time fans were hoping that he would", "start": 90.02, "duration": 4.52}, {"text": "come through with an album that was more of a true-blue hip-hop experience.", "start": 94.54, "duration": 4.68}, {"text": "But, IGOR is not that.", "start": 99.22, "duration": 1.88}, {"text": "The instrumentals on this record embrace even more soul, even more R&B.", "start": 101.1, "duration": 4.52}, {"text": "And, not to say that aren't points on this album where Tyler raps, there are.", "start": 105.62, "duration": 4.38}, {"text": "He even makes sure to work a few bangers into the mix like NEW MAGIC WAND as-well as WHAT'S GOOD,", "start": 110.0, "duration": 4.86}, {"text": "but these cuts are more the exception than the rule.", "start": 114.86, "duration": 2.52}, {"text": "Again most of the tracks on this album fit into more of a soul categorization.", "start": 117.38, "duration": 3.94}, {"text": "With some of the instrumentation on them throwing it back the '60s and '70s.", "start": 121.32, "duration": 4.16}, {"text": "Such as A BOY IS A GUN and ARE WE STILL FRIENDS as-well as EARFQUAKE to a degree.", "start": 125.48, "duration": 4.96}, {"text": "And, it's a weird vibe. Tyler's embrace of these sounds, feels like a combination of several different things.", "start": 130.44, "duration": 6.18}, {"text": "The tone of the instrumentation, the kind of messy production and the singing on here", "start": 136.62, "duration": 4.44}, {"text": "leaves me feeling like I'm hearing Tyler be a little tongue-in-cheek.", "start": 141.06, "duration": 4.2}, {"text": "But given the narrative of these tracks it does feel like he's trying to express some genuine feelings here.", "start": 145.26, "duration": 5.18}, {"text": "The textures and timbres in the instrumentation are great too, but it is a decidedly rough presentation.", "start": 150.44, "duration": 6.88}, {"text": "A little lo-fi in the same way Cherry Bomb was.", "start": 157.34, "duration": 3.04}, {"text": "Some of the mixes are kind of funny.", "start": 160.38, "duration": 1.52}, {"text": "But even though some of Tyler's lack-luster production in the past has rubbed me the wrong way.", "start": 161.9, "duration": 4.58}, {"text": "With IGOR it feels like it's coming from a place of skill.", "start": 166.48, "duration": 3.48}, {"text": "Essentially, it's the difference between making a sub-par recording because you can't make anything else", "start": 169.96, "duration": 4.58}, {"text": "other than a sub-par recording and going back to embrace and more flawed and gruff, raw aesthetic", "start": 174.54, "duration": 5.78}, {"text": "once you have gained the ability to make something as clean and as well crafted as Flower Boy.", "start": 180.32, "duration": 5.96}, {"text": "It's almost post-punk in a way, Tyler's ability to subvert and mutate the smooth, jazzy and sweet", "start": 186.9, "duration": 6.48}, {"text": "sounds of Soul and R&B throughout multiple tracks on this album.", "start": 193.38, "duration": 3.66}, {"text": "It's also worth mentioning that it is painfully obvious that the work of Pharell", "start": 197.04, "duration": 4.52}, {"text": "has been hugely influential to the instrumental front of this record too.", "start": 201.56, "duration": 4.62}, {"text": "Which given Tyler's history should no surprise. He has been and unapologetic fan of Williams for a long-time.", "start": 206.18, "duration": 6.6}, {"text": "But never before in my opinion has he embraced so many obvious Pharell-isms in his music this hard,", "start": 212.78, "duration": 7.74}, {"text": "but also kind of made them his-own.", "start": 220.52, "duration": 2.94}, {"text": "The world that Tyler presents on IGOR, and I do think it is a world, is vivid, it's seamless, it is immersive.", "start": 224.36, "duration": 7.0}, {"text": "While I'm mentioning influences in this review, I should also name-drop rapper, producer, legend Madlib too.", "start": 231.36, "duration": 6.02}, {"text": "Not only because of the artfully rough production and vintage samples placed throughout this album,", "start": 237.38, "duration": 5.12}, {"text": "but also the pitched vocals and character development that Tyler engages in on IGOR", "start": 242.5, "duration": 5.04}, {"text": "also reminds me of some of Madlib's Quasimoto efforts.", "start": 247.54, "duration": 3.28}, {"text": "As far as the run-time goes IGOR also has an impeccable flow.", "start": 250.82, "duration": 4.0}, {"text": "There is really no excuse to leave until the last track is over,", "start": 254.82, "duration": 3.84}, {"text": "even if the narrative of the album doesn't follow the most obvious progression.", "start": 258.66, "duration": 4.28}, {"text": "On IGOR's earliest moments we already see the relationship that the album is based-on", "start": 262.94, "duration": 5.62}, {"text": "in a moment of crisis, with Tyler begging his romantic-interest here not to leave.", "start": 268.56, "duration": 7.24}, {"text": "And, as the album progresses we get different flavours of romantic-toxicity,", "start": 275.8, "duration": 4.76}, {"text": "illustrating exactly why this relationship is crumbling in the first-place.", "start": 280.56, "duration": 4.42}, {"text": "Things essentially reach a dead-end with the revelation of I DON'T LOVE YOU ANYMORE.", "start": 284.98, "duration": 3.84}, {"text": "We also have a moment of finality after that with ARE WE STILL FRIENDS.", "start": 288.82, "duration": 4.76}, {"text": "Like volatile relationships themselves, the album is kind of like being stuck", "start": 293.58, "duration": 4.64}, {"text": "in the middle of a continuous tumble-cycle.", "start": 298.24, "duration": 3.58}, {"text": "And, when it's over you are busy to decipher exactly what happened, who's at fault", "start": 301.82, "duration": 5.16}, {"text": "and how you can prevent it from happening again.", "start": 306.98, "duration": 3.06}, {"text": "IGOR is an album that leaves the listener with in my opinion quite a few loose-ends and unresolved feelings,", "start": 310.04, "duration": 6.82}, {"text": "but it's still a very satisfying and cathartic project.", "start": 316.86, "duration": 3.64}, {"text": "The song EARFQUAKE is kind of mellow and maybe even a little funny at first glance,", "start": 320.5, "duration": 4.24}, {"text": "but with more listens it becomes clear that Tyler is actually pouring his heart into these", "start": 324.74, "duration": 5.36}, {"text": "squeaky weird lead vocals.", "start": 330.1, "duration": 2.52}, {"text": "The heartbreak coming off the lyrics is tangible", "start": 332.62, "duration": 2.42}, {"text": "even if there is a supremely large element of camp to what Tyler is doing here.", "start": 335.04, "duration": 5.36}, {"text": "♪ When it all comes crashing down I'll need you ♪", "start": 340.4, "duration": 4.96}, {"text": "There's also a Playboi Carti feature on this track that is placed perfectly.", "start": 345.36, "duration": 4.12}, {"text": "His weird baby-voiced verse fits the aesthetic of the song quite well", "start": 349.92, "duration": 4.64}, {"text": "and he is one of many very fantastic and impressive guests on this record.", "start": 354.56, "duration": 4.16}, {"text": "Many of which are a little obscured and kind of buried in the mixes of particular tracks,", "start": 358.72, "duration": 5.32}, {"text": "I mean they certainly add to the character and flavour of this album,", "start": 364.04, "duration": 3.9}, {"text": "but there aren't a whole lot of features on this record that stun or steal the spotlight away", "start": 367.94, "duration": 5.84}, {"text": "from the character and the persona and the story and the focus of the album.", "start": 373.78, "duration": 4.68}, {"text": "Which ultimately I think is a good thing, if anything the features, especially on a record like this,", "start": 378.46, "duration": 4.32}, {"text": "should be playing a more supportive role.", "start": 382.78, "duration": 2.1}, {"text": "The song I THINK right after this makes for a pretty interesting transition.", "start": 384.88, "duration": 3.94}, {"text": "I think the lo-fi production on this tracks obscures it, but this song is so friggen' Kanye West.", "start": 390.86, "duration": 6.38}, {"text": "I have never heard Tyler write a song that is so obviously Kanye.", "start": 397.24, "duration": 4.56}, {"text": "This track, the instrumental here, some of the flows.", "start": 401.8, "duration": 3.42}, {"text": "It's the dance beat, it's the glistening synths.", "start": 405.22, "duration": 2.72}, {"text": "This sounds just like something Kanye would rock during the graduation era, frankly.", "start": 407.94, "duration": 4.36}, {"text": "It is a very solid tune though, given the aesthetic of the album, the narrative of the record", "start": 412.3, "duration": 4.74}, {"text": "and the jazzy bridge that Tyler works into the track, he obviously puts his own spin on all of this.", "start": 417.04, "duration": 6.04}, {"text": "RUNNING OUT OF TIME in my opinion, not a bad track,", "start": 423.08, "duration": 2.46}, {"text": "but easily the weakest of the more mellow and soulful cuts on the first-leg of this record.", "start": 425.54, "duration": 5.12}, {"text": "I think the intro draws on a bit long, but it's still a necessary moment on the album.", "start": 430.66, "duration": 4.56}, {"text": "If not only for it's swirling, cascading synth-arpeggios and lush instrumental-bridge.", "start": 435.22, "duration": 5.48}, {"text": "Also, super cold-blooded verse at the ending of this track.", "start": 440.7, "duration": 3.68}, {"text": "And, what this song gives to the album narratively is that Tyler feels this relationship or his chances to save it,", "start": 444.38, "duration": 7.44}, {"text": "his ability to maintain this other person's interest is slipping away, he's losing his grip on it.", "start": 451.82, "duration": 6.06}, {"text": "All of this tracks up until this point do a very good job of setting the tone for the record,", "start": 457.88, "duration": 3.86}, {"text": "but after this we begin to enter banger territory.", "start": 461.74, "duration": 3.48}, {"text": "We get NEW MAGIC WAND, which is the first touch of real emotional darkness on the album in my opinion.", "start": 465.22, "duration": 7.02}, {"text": "Which is forecast by the instrumental's sinister electric-piano,", "start": 472.24, "duration": 4.04}, {"text": "the kind of skittery metallic bits of percussion in the instrumental", "start": 476.28, "duration": 3.98}, {"text": "that sound like spoons being hit onto dinner plates,", "start": 480.26, "duration": 3.22}, {"text": "the distant horror-movie synths, the growling distorted bass, of which there is quite a bit of on this entire album.", "start": 483.52, "duration": 7.0}, {"text": "Tyler's lyrics on this track seem to be coming from more of a place of", "start": 490.52, "duration": 4.04}, {"text": "extreme jealousy, violent psychosis, desperation.", "start": 494.56, "duration": 4.08}, {"text": "There's a love triangle angle presented in this track", "start": 498.64, "duration": 2.8}, {"text": "where Tyler essentially feels like he's competing with his significant-other's ex-girlfriend for attention, for love.", "start": 501.44, "duration": 6.18}, {"text": "He says he needs to \"get her out of the picture\".", "start": 507.62, "duration": 2.58}, {"text": "And, he genuinely seems like he's going mad on this track.", "start": 510.2, "duration": 3.08}, {"text": "It's like this Norman Bates style of", "start": 513.28, "duration": 2.46}, {"text": "ahhhhhh rahhhh", "start": 515.74, "duration": 1.24}, {"text": "total and absolute madness.", "start": 516.98, "duration": 1.8}, {"text": "And I also think this tracks illustrates exactly why the title of this record is what it is.", "start": 518.78, "duration": 4.78}, {"text": "We see this love, we see this relationship turning Tyler into IGOR,", "start": 523.56, "duration": 5.18}, {"text": "which is a name that typically is associated with monster, with freaks, with hideous beasts.", "start": 528.74, "duration": 6.08}, {"text": "A BOY IS A GUN is another stroke of genius in the track-list that is also obviously Kanye inspired.", "start": 534.82, "duration": 6.42}, {"text": "From the glamorous grooves to the pitched vocal-samples, as-well as some of the refrains on here.", "start": 541.24, "duration": 6.12}, {"text": "♪ You so mother-fucking dangerous, You so mother-fucking dangerous ♪", "start": 547.36, "duration": 4.34}, {"text": "This sounds exactly like something that would have landed on Kanye's first couple of records.", "start": 551.7, "duration": 5.1}, {"text": "Not to mention that,", "start": 556.8, "duration": 1.34}, {"text": "\"How come you the best to me? I know you the worst for me. You sweet and as sugar, diabetic to the first-degree.\"", "start": 558.14, "duration": 6.88}, {"text": "That is the most Kanye line that Kanye has never written.", "start": 565.02, "duration": 3.14}, {"text": "And the rest of the lyrics on this though do continue to expose", "start": 568.16, "duration": 3.24}, {"text": "why exactly this relationship that Tyler is in is so bad for him and the other person.", "start": 571.4, "duration": 5.76}, {"text": "Their exchanges and interactions are just absolutely hideous.", "start": 577.16, "duration": 3.84}, {"text": "To the point where, I'm waiting for the relationship to be over.", "start": 581.0, "duration": 3.22}, {"text": "But again, the tone changes on the very next track, PUPPET,", "start": 584.22, "duration": 3.08}, {"text": "where Tyler now feels like he is being controlled by his addiction and his affection for this other person.", "start": 587.3, "duration": 8.74}, {"text": "Tyler's attitude essentially doing a total 180 from the last track", "start": 596.04, "duration": 3.76}, {"text": "and now he's bending over backwards doing everything that he can to keep this persons affection.", "start": 599.8, "duration": 5.2}, {"text": "The song eventually turns cinematic, with an instrumental shift presenting these marching snares,", "start": 605.0, "duration": 5.22}, {"text": "sparse twinkling melodies and dusty strings,", "start": 610.22, "duration": 2.94}, {"text": "it feels like a combo of an old-school soul song and a harrowing Bright Eyes ballad.", "start": 613.16, "duration": 5.06}, {"text": "Kanye West himself also makes an appearance in the second half of this track.", "start": 618.22, "duration": 4.46}, {"text": "It's a little buried, but it adds quite a bit to the song", "start": 622.68, "duration": 2.74}, {"text": "and occurs just before the instrumental turns the track into a slow downward elevator ride into hell.", "start": 625.42, "duration": 7.88}, {"text": "The track WHAT'S GOOD is easily the hardest and most aggressive cut on the entire record.", "start": 633.3, "duration": 4.94}, {"text": "I would say he's still in character here,", "start": 638.24, "duration": 1.8}, {"text": "though he does blatantly reference a car accident that he was in last year in the lyrics.", "start": 640.04, "duration": 4.3}, {"text": "We also hear this song right after a vocal-snippet ending the song PUPPET off,", "start": 644.34, "duration": 4.18}, {"text": "where somebody is saying \"but at some point you come to your senses\".", "start": 648.52, "duration": 4.02}, {"text": "Which is one of several moments on this album,", "start": 652.54, "duration": 2.26}, {"text": "where you catch these casual spoken-work snippets that sound like they're lifted from a conversation", "start": 654.8, "duration": 6.28}, {"text": "or an interview.", "start": 661.08, "duration": 1.8}, {"text": "Tyler even places one all by itself on the fourth track of the album.", "start": 662.88, "duration": 4.22}, {"text": "And, you might tune these moments out or not think too much of them on first listen,", "start": 667.1, "duration": 3.86}, {"text": "but please do pay attention.", "start": 670.96, "duration": 1.84}, {"text": "Because for the most part,", "start": 672.8, "duration": 1.62}, {"text": "these little passages do tend to forecast whatever the mood the next song is moving into.", "start": 674.42, "duration": 6.82}, {"text": "Anyways, WHAT'S GOOD, fierce delivery, fierce flows, bold noisy beat, truly evil attitude on this track.", "start": 681.24, "duration": 7.2}, {"text": "it's not my favourite tune on this entire record, but it is braggadocious, it is self-affirming", "start": 688.44, "duration": 5.5}, {"text": "and it is pivotal to the evolution of this relationship and of IGOR on this record.", "start": 693.94, "duration": 6.8}, {"text": "It's like continuously seeing the ego and the love of IGOR balloon and pop, balloon and pop throughout this record.", "start": 700.74, "duration": 7.56}, {"text": "So IGOR now has seen the light and the love this album is oriented around, it's GONE GONE.", "start": 708.3, "duration": 5.44}, {"text": "Which is a very bright and summery tune,", "start": 713.74, "duration": 2.2}, {"text": "the instrumental here might be trying to symbolize", "start": 715.94, "duration": 2.44}, {"text": "the euphoric bliss of breaking off a relationship that is very bad for you.", "start": 718.38, "duration": 5.58}, {"text": "There's very little on this track in-terms of feelings of regret, even with lyrics like", "start": 723.96, "duration": 4.32}, {"text": "\"At least i had it, instead of never or maybe I'm too dramatic\".", "start": 728.48, "duration": 4.16}, {"text": "This song is also a two-part track because eventually we transition into the THANK YOU side,", "start": 732.64, "duration": 4.86}, {"text": "which is built mainly off of a verse from Tyler where he's sort of confirming that he doesn't need this relationship,", "start": 737.5, "duration": 6.68}, {"text": "this is a good move for him.", "start": 744.18, "duration": 1.58}, {"text": "Him and this other person were working off of two different blueprints", "start": 745.76, "duration": 3.4}, {"text": "in the midst of a genius set of bars that reference buildings and architecture.", "start": 749.16, "duration": 5.12}, {"text": "I also quite a bit, the following track I DON'T LOVE YOU ANYMORE.", "start": 754.28, "duration": 3.56}, {"text": "Instrumentally and vocally the song sounds so small,", "start": 757.84, "duration": 3.8}, {"text": "but emotionally this track is Tyler throwing a temper-tantrum.", "start": 761.64, "duration": 4.42}, {"text": "He's stomping around and saying", "start": 766.06, "duration": 2.76}, {"text": "♪ I don't love you anymore ♪", "start": 768.82, "duration": 1.48}, {"text": "And, it's hard to tell at points if he actually feels this way", "start": 770.3, "duration": 3.78}, {"text": "or if he's just saying this convince himself that that's what he wants to feel.", "start": 774.08, "duration": 5.88}, {"text": "Going deeper into the lyrics here does reveal emotions of wanting to move on, but necessarily knowing how.", "start": 779.96, "duration": 6.8}, {"text": "The instrumental on this track is dark, it's moody, it's painful, it's depressed.", "start": 786.76, "duration": 5.72}, {"text": "Not quite as happy about the breakup of this relationship as GONE GONE.", "start": 792.48, "duration": 3.74}, {"text": "And finally, ARE WE STILL FRIENDS is maybe one of my favourite closers of 2019.", "start": 796.22, "duration": 5.94}, {"text": "It birngs back the hokey soul-singer vibe of the first leg of the album,", "start": 802.16, "duration": 4.38}, {"text": "but i would say it goes even harder in that respect.", "start": 806.54, "duration": 2.72}, {"text": "With Tyler's voice just spotlit on a stage in front of backing bass and guitar.", "start": 809.26, "duration": 6.88}, {"text": "Very gentle, you have some backup-singers in there as-well, kind of buried drums.", "start": 816.14, "duration": 4.14}, {"text": "The track builds up to this vocal freakout that is actually pretty amazing", "start": 820.28, "duration": 4.86}, {"text": "It's a powerfully dramatic finish,", "start": 825.14, "duration": 1.7}, {"text": "but I can understand that you may not feel that way if you think the production is a little messy or muddy", "start": 826.84, "duration": 5.74}, {"text": "or if you haven't listened to the entire album up until this point.", "start": 832.58, "duration": 2.66}, {"text": "Because the song makes way more sense when you're viewing it through the weird lens that IGOR offers.", "start": 835.24, "duration": 6.54}, {"text": "Maybe the goofy background-vocals or the fake-ass synth-strings that are mixed very, very high.", "start": 841.78, "duration": 7.5}, {"text": "Maybe they don't do much for you.", "start": 849.28, "duration": 1.78}, {"text": "But, this track is actually amazing when you consider that it is the climax of", "start": 851.06, "duration": 4.32}, {"text": "what's essentially Tyler doing the musical equivalent to a one man play here.", "start": 855.38, "duration": 5.66}, {"text": "Of course, there are supporting musicians and artists, but you know what I mean.", "start": 861.04, "duration": 3.74}, {"text": "I do maybe have a few issues with the album though,", "start": 864.78, "duration": 2.4}, {"text": "there a few tracks where I think the structure and the development of the song could be better.", "start": 867.18, "duration": 5.0}, {"text": "Tyler also is wearing his influences on his sleeves very obviously throughout this record,", "start": 872.18, "duration": 6.6}, {"text": "to the point where it can be slightly distracting.", "start": 878.78, "duration": 2.78}, {"text": "And, while I do like the lo-fi aesthetic there are points where", "start": 881.56, "duration": 3.3}, {"text": "in the long-run of the track-list it does feel like it dampens the overall auditory experience.", "start": 884.86, "duration": 6.12}, {"text": "I might call it one-dimensional if not for the fact that", "start": 890.98, "duration": 3.22}, {"text": "the songs and narratives and emotions displayed throughout this album are so wide and vivid.", "start": 894.2, "duration": 6.22}, {"text": "I actually think the sound of this album is about as rich", "start": 900.42, "duration": 2.86}, {"text": "as the pink, black, white, grey colour palette of the album art here.", "start": 903.28, "duration": 4.66}, {"text": "It's obviously limited, but still presents a very compelling and sort of unsettling image.", "start": 907.94, "duration": 5.68}, {"text": "Overall I think IGOR is a fantastic album and is easily one of the best breakup albums of the decade.", "start": 913.62, "duration": 6.28}, {"text": "Which is no small feat considering that we're literally right toward the end of this decade.", "start": 919.9, "duration": 5.8}, {"text": "I'm feeling a decent to a strong 9 on this thing.", "start": 925.7, "duration": 2.9}, {"text": "Tran-", "start": 928.6, "duration": 0.58}, {"text": "-sition have you given this album a listen?", "start": 929.18, "duration": 1.9}, {"text": "Did you love it? Did you hate it? What would you rate it?", "start": 931.08, "duration": 2.12}, {"text": "You're the best, You're the best, what should I review next?", "start": 933.2, "duration": 2.1}, {"text": "Hit the like if you like, please subscribe and please don't cry, hit the bell as-well.", "start": 935.3, "duration": 3.78}, {"text": "Over here next  to my head is another video you can check out.", "start": 939.08, "duration": 2.78}, {"text": "Hit that up or the link to subscribe to the channel.", "start": 941.86, "duration": 2.36}, {"text": "Anthony Fantano, Tyler, the Creator, IGOR, fovever!", "start": 944.22, "duration": 4.2}]